[{"title": "Homemade Pasta Roni", "image_path": "Images\\Homemade_Pasta_Roni.jpg", "ingredients": ["2 cups chicken broth", "3 ounces angel hair pasta", "1 tablespoon butter", "1 clove garlic, minced", "0.5 teaspoon Italian seasoning", "0.25 cup heavy cream", "0.75 cup finely shredded Parmesan cheese", "1 teaspoon minced fresh parsley, or to taste"], "instructions": "Bring chicken broth in a saucepan to a boil over medium-high heat. Cook angel hair pasta in the boiling broth, stirring occasionally, until tender yet firm to the bite, 4 to 5 minutes.\nDrain pasta, reserving 1/4 cup of chicken broth.\nMelt butter in a saucepan over medium-low heat; add garlic and cook until fragrant, about 30 seconds. Stir in Italian seasoning, reserved 1/4 cup chicken broth, and whipping cream. Add Parmesan cheese and stir until melted.\nStir in angel hair pasta; toss to coat. Garnish with freshly minced parsley."}, {"title": "Quick and Easy Pancit", "image_path": "Images\\Quick_and_Easy_Pancit.jpg", "ingredients": ["1 (12 ounce) package dried rice noodles", "1 teaspoon vegetable oil", "1 onion, finely diced", "3 cloves garlic, minced", "2 cups diced cooked chicken breast meat", "1 small head cabbage, thinly sliced", "4 carrot, thinly sliced", "0.25 cup soy sauce", "2 lemons - cut into wedges, for garnish"], "instructions": "Gather all ingredients.\nPlace rice noodles in a large bowl; cover with warm water and let soften for 8 to 10 minutes. Drain and set aside.\nMeanwhile, heat oil in a wok or large skillet over medium-low heat. Add onion and garlic; cook and stir until onion is tender, about 3 to 5 minutes. Stir in chicken, cabbage, carrots, and soy sauce. Cook until cabbage begins to soften.\nToss in noodles and cook, stirring constantly, until heated through.\nTransfer pancit to a serving dish and garnish with lemon wedges."}, {"title": "To Die For Fettuccine Alfredo", "image_path": "Images\\To_Die_For_Fettuccine_Alfredo.jpg", "ingredients": ["24 ounces dry fettuccine pasta", "1 cup butter", "0.75 pint heavy cream", "salt and pepper to taste", "1 dash garlic salt", "0.75 cup grated Romano cheese", "0.5 cup grated Parmesan cheese"], "instructions": "Bring a large pot of lightly salted water to a boil. Add fettuccine and cook for 8 to 10 minutes or until al dente; drain.\nMelt butter into cream in a large saucepan over low heat; add salt, pepper, and garlic salt. Increase the heat to medium; stir in grated Romano and Parmesan cheese until melted and sauce has thickened.\nAdd cooked pasta to sauce and toss until thoroughly coated; serve immediately."}, {"title": "Quick Beef Stir-Fry", "image_path": "Images\\Quick_Beef_Stir-Fry.jpg", "ingredients": ["2 tablespoons vegetable oil", "1 pound beef sirloin, cut into 2-inch strips", "1.5 cups fresh broccoli florets", "1 red bell pepper, cut into matchsticks", "2 carrots, thinly sliced", "1 green onion, chopped", "1 teaspoon minced garlic", "2 tablespoons soy sauce", "2 tablespoons sesame seeds, toasted"], "instructions": "Gather all ingredients.\nHeat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes.\nMove beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes.\nStir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes.\nServe hot and enjoy!"}, {"title": "Pesto Pasta", "image_path": "Images\\Pesto_Pasta.jpg", "ingredients": ["1 (16 ounce) package pasta", "2 tablespoons olive oil", "0.5 cup chopped onion", "2.5 tablespoons pesto", "salt to taste", "ground black pepper to taste", "2 tablespoons grated Parmesan cheese"], "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in pasta and return to a boil. Cook pasta uncovered, stirring occasionally, until tender yet firm to the bite, about 8 to 10 minutes. Drain and transfer into a large bowl.\nMeanwhile, heat oil in a frying pan over medium-low heat. Add onion; cook and stir until softened, about 3 minutes. Stir in pesto, salt, and pepper until warmed through.\nAdd pesto mixture to hot pasta; stir in grated cheese and toss well to coat."}, {"title": "Spicy Thai Basil Chicken (Pad Krapow Gai)", "image_path": "Images\\Spicy_Thai_Basil_Chicken_(Pad_Krapow_Gai).jpg", "ingredients": ["0.33333334326744 cup chicken broth", "1 tablespoon oyster sauce", "1 tablespoon soy sauce, or as needed", "2 teaspoons fish sauce", "1 teaspoon white sugar", "1 teaspoon brown sugar", "2 tablespoons vegetable oil", "1 pound skinless, boneless chicken thighs, coarsely chopped", "0.25 cup sliced shallots", "4 cloves garlic, minced", "2 tablespoons minced Thai chilies, Serrano, or other hot pepper", "1 cup very thinly sliced fresh basil leaves", "2 cups hot cooked rice"], "instructions": "Gather ingredients.\nWhisk chicken broth, oyster sauce, soy sauce, fish sauce, white sugar, and brown sugar together in a bowl until well blended.\nHeat large skillet over high heat. Drizzle in oil. Add chicken and stir fry until it loses its raw color, 2 to 3 minutes.\nStir in shallots, garlic, and sliced chilies. Continue cooking on high heat until some of the juices start to caramelize in the bottom of the pan, about 2 or 3 more minutes.\nAdd about a tablespoon of the sauce mixture to the skillet; cook and stir until sauce begins to caramelize, about 1 minute.\nPour in the rest of the sauce. Cook and stir until sauce has deglazed the bottom of the pan. Continue to cook until sauce glazes onto the meat, 1 or 2 more minutes. Remove from heat.\nStir in basil. Cook and stir until basil is wilted, about 20 seconds. Serve with rice.\nServe hot and enjoy!"}, {"title": "Chicken Katsu", "image_path": "Images\\Chicken_Katsu.jpg", "ingredients": ["4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness", "salt and pepper to taste", "2 tablespoons all-purpose flour", "1 egg, beaten", "1 cup panko bread crumbs", "1 cup oil for frying, or as needed"], "instructions": "Season chicken breasts on both sides with salt and pepper. Place flour, beaten egg, and panko crumbs into separate shallow dishes. Coat chicken breasts in flour, shaking off any excess; dip into egg, and then press into panko crumbs until well coated on both sides.\nHeat oil in a large skillet over medium-high heat. Place chicken in the hot oil, and fry until golden brown, 3 or 4 minutes per side. Transfer to a paper towel-lined plate to drain."}, {"title": "Simple Beef Stroganoff", "image_path": "Images\\Simple_Beef_Stroganoff.jpg", "ingredients": ["1 (8 ounce) package egg noodles", "1 pound ground beef", "1 (10.5 ounce) can fat-free condensed cream of mushroom soup", "1 tablespoon garlic powder", "0.5 cup sour cream", "salt and ground black pepper to taste"], "instructions": "Gather all ingredients.\nSauté ground beef in a large skillet over medium heat until browned and crumbly; 5 to 10 minutes.\nMeanwhile, fill a large pot with lightly salted water and bring to a rapid boil. Cook egg noodles at a boil until tender yet firm to the bite, 7 to 9 minutes. Drain and set aside.\nDrain and discard any fat from the cooked beef. Stir condensed soup and garlic powder into the beef. Simmer for 10 minutes, stirring occasionally.\nRemove beef from the heat. Add egg noodles and stir to combine. Stir in sour cream and season with salt and pepper.\nServe hot and enjoy!"}, {"title": "Chicken Marsala", "image_path": "Images\\Chicken_Marsala.jpg", "ingredients": ["0.25 cup all-purpose flour for coating", "0.5 teaspoon salt", "0.25 teaspoon ground black pepper", "0.5 teaspoon dried oregano", "4 medium skinless, boneless chicken breast halves - pounded 1/4 inch thick", "4 tablespoons butter", "4 tablespoons olive oil", "1 cup sliced mushrooms", "0.5 cup Marsala wine", "0.25 cup cooking sherry"], "instructions": "Gather all ingredients.\nIn a shallow dish or bowl, mix together the flour, salt, pepper and oregano.\nCoat chicken pieces in flour mixture.\nIn a large skillet, melt butter in olive oil over medium heat. Place chicken in the pan, and lightly brown.\nTurn over chicken pieces, and add mushrooms. Pour in wine and sherry.\nCover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear.\nServe hot and enjoy!"}, {"title": "Pan-Seared Tilapia", "image_path": "Images\\Pan-Seared_Tilapia.jpg", "ingredients": ["4 (4 ounce) tilapia fillets", "salt and ground black pepper to taste", "0.5 cup all-purpose flour", "1 tablespoon olive oil", "2 tablespoons unsalted butter, melted", "1 tablespoon lemon juice, or to taste", "1 teaspoon chopped fresh flat-leaf parsley, or to taste", "0.5 teaspoon chopped fresh thyme, or to taste"], "instructions": "Rinse tilapia fillets in cold water and pat dry with paper towels. Season both sides of each fillet with salt and pepper.\nPlace flour in a shallow dish. Gently press each fillet into the flour to coat and shake off any excess.\nHeat olive oil in a large skillet over medium-high heat. Cook tilapia fillets in the hot oil, in batches if necessary, until fish flakes easily with a fork, about 4 minutes per side.\nBrush melted butter onto the tilapia fillets in the last minute before removing from the skillet.\nDrizzle fillets with lemon juice and garnish with parsley and thyme."}, {"title": "Easy Tuna Patties", "image_path": "Images\\Easy_Tuna_Patties.jpg", "ingredients": ["2 eggs", "2 teaspoons lemon juice", "10 tablespoons Italian-seasoned bread crumbs", "3 tablespoons grated Parmesan cheese", "3 (5 ounce) cans tuna, drained", "3 tablespoons diced onion", "1 pinch ground black pepper", "3 tablespoons vegetable oil"], "instructions": "Beat eggs and lemon juice in a bowl; stir in bread crumbs and Parmesan cheese to make a paste. Fold in tuna and onion until well combined; season with black pepper.\nUse your hands to shape tuna mixture into 8 (1-inch-thick) patties.\nHeat vegetable oil in a skillet over medium heat. Fry patties in the hot oil until golden brown, about 5 minutes per side."}, {"title": "Easy Garlic-Lemon Scallops", "image_path": "Images\\Easy_Garlic-Lemon_Scallops.jpg", "ingredients": ["0.75 cup butter", "3 tablespoons minced garlic", "2 pounds large sea scallops", "2 tablespoons fresh lemon juice", "1 teaspoon salt", "0.125 teaspoon pepper"], "instructions": "Melt butter in a large skillet over medium heat. Stir in garlic and cook for a few seconds until fragrant.\nArrange scallops in a single layer in the skillet; cook until golden brown on one side, about 2 minutes. Turn scallops over using tongs and continue cooking until firm and opaque, about 2 minutes more. Transfer scallops to a platter, reserving butter in the skillet.\nWhisk lemon juice, salt, and pepper into butter; pour sauce over scallops to serve."}, {"title": "Black Beans and Rice", "image_path": "Images\\Black_Beans_and_Rice.jpg", "ingredients": ["1 teaspoon olive oil", "1 onion, chopped", "2 cloves garlic, minced", "0.75 cup uncooked white rice", "1.5 cups low sodium, low fat vegetable broth", "3.5 cups canned black beans, drained", "1 teaspoon ground cumin", "0.25 teaspoon cayenne pepper"], "instructions": "Heat oil in a saucepan over medium-high heat. Add onion and garlic; cook and stir until onion has softened, about 4 minutes. Stir in rice to coat; cook and stir for 2 minutes.\nAdd vegetable broth and bring to a boil. Cover, reduce to a simmer, and cook until liquid is absorbed, about 20 minutes.\nStir in beans, cumin, and cayenne; cook until beans are warmed through."}, {"title": "Bourbon Chicken", "image_path": "Images\\Bourbon_Chicken.jpg", "ingredients": ["1 ½ pounds skinless, boneless chicken thighs", "2 tablespoons cornstarch", "2 tablespoons olive oil", "2 tablespoons dried minced onion", "0.5 teaspoon garlic powder", "1 teaspoon ground ginger", "1/3 cup reduced sodium soy sauce", "1/3 cup reduced-sodium chicken broth", "1/4 cup bourbon", "0.5 cup packed brown sugar", "1 tablespoon cider vinegar", "1/4 teaspoon crushed red pepper", "2 cups hot cooked rice", "2 green onions, sliced"], "instructions": "Gather Ingredients.\nToss chicken with 1 tablespoon cornstarch in a medium bowl.\nHeat 1 tablespoon oil in a 12-inch skillet over medium-high heat; add chicken. Cook and stir until browned; transfer to a plate using a slotted spoon.\nHeat remaining 1 tablespoon oil in same skillet. Add onion, garlic, and ginger; cook and stir until softened and fragrant, 1 to 3 minutes.\nStir remaining 1 tablespoon cornstarch, soy sauce, broth, bourbon, brown sugar, vinegar, and crushed red pepper together in a small bowl.\nAdd sauce mixture to skillet; cook and stir until thickened and bubbly.\nReturn chicken to skillet. Cook and stir until coated in sauce and heated through, about 2 minutes.\nServe over rice. Top with green onions."}, {"title": "Creamed Chipped Beef on Toast", "image_path": "Images\\Creamed_Chipped_Beef_on_Toast.jpg", "ingredients": ["2 tablespoons butter", "2 tablespoons all-purpose flour", "1.5 cups warm milk", "1 (8 ounce) jar dried beef, chopped", "1 pinch cayenne pepper", "bread, toasted"], "instructions": "Melt butter in a medium saucepan over low heat. Add flour and whisk until smooth. Add milk a little at a time, whisking well after each addition. Bring to a boil over medium-high heat and cook, stirring, until thickened.\nStir in beef and cayenne; cook until warmed through. Serve over toast."}, {"title": "Buttered Noodles", "image_path": "Images\\Buttered_Noodles.jpg", "ingredients": ["1 (16 ounce) package fettuccine noodles", "6 tablespoons butter, cut into pieces", "0.33333334326744 cup grated Parmesan cheese", "salt and ground black pepper to taste"], "instructions": "Gather all ingredients.\nFill a large pot with lightly salted water and bring to a rolling boil.\nStir in fettuccine, bring back to a boil, and cook pasta over medium heat until tender yet firm to the bite, 8 to 10 minutes.\nDrain and return pasta to pot. Mix butter, Parmesan cheese, salt, and pepper into pasta until evenly combined.\nServe hot and enjoy!"}, {"title": "Southern Fried Catfish", "image_path": "Images\\Southern_Fried_Catfish.jpg", "ingredients": ["0.5 cup buttermilk", "0.5 cup water", "salt and pepper, to taste", "1 pound catfish fillets, cut in strips", "1.5 cups fine cornmeal", "0.5 cup all-purpose flour", "1 teaspoon seafood seasoning, such as Old Bay™", "1 quart vegetable oil for deep frying"], "instructions": "Mix buttermilk, water, salt, and pepper in a small bowl. Pour mixture into a flat pan large enough to hold fillets. Arrange fillets in a single layer in the pan, turning to coat each side. Set aside to marinate.\nCombine cornmeal, flour, and seafood seasoning in a 2-gallon resealable plastic bag. Add fillets to the bag, a few at a time, and tumble gently until evenly coated.\nHeat oil in a deep fryer to 365 degrees F (185 degrees C).\nFry fillets in hot oil until crisp and golden brown, about 3 minutes. Work in batches to avoid overcrowding, so fillets have room to brown properly. Drain on paper towels."}, {"title": "Air Fryer Chicken Thighs", "image_path": "Images\\Air_Fryer_Chicken_Thighs.jpg", "ingredients": ["4 skin-on, boneless chicken thighs", "2 teaspoons extra-virgin olive oil", "1 teaspoon smoked paprika", "0.75 teaspoon garlic powder", "0.5 teaspoon salt", "0.5 teaspoon ground black pepper"], "instructions": "Gather all ingredients and preheat an air fryer to 400 degrees F (200 degrees C).\nPat chicken thighs dry with a paper towel and brush skins with olive oil. Place chicken thighs, skin-side down, in a single layer on a plate.\nCombine smoked paprika, garlic powder, salt, and pepper in a bowl. Sprinkle 1/2 of the seasoning mixture evenly over thighs. Turn thighs over and evenly sprinkle with remaining seasoning. Arrange thighs, skin-side up, in a single layer in the air fryer basket.\nCook in the preheated air fryer until thighs are brown and the juices run clear, about 18 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nServe and enjoy!"}, {"title": "Simple Broiled Haddock", "image_path": "Images\\Simple_Broiled_Haddock.jpg", "ingredients": ["2 pounds haddock fillets", "0.5 teaspoon onion powder", "0.5 teaspoon paprika", "0.5 teaspoon garlic powder", "0.5 teaspoon ground black pepper", "0.5 teaspoon salt", "0.25 teaspoon cayenne pepper", "1 tablespoon butter, cut in small pieces", "1 lemon, cut into wedges"], "instructions": "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil; spray with cooking spray.\nArrange haddock fillets on the prepared baking sheet.\nMix onion powder, paprika, garlic powder, black pepper, salt, and cayenne pepper in a small bowl; sprinkle seasoning over fish, then dot with butter.\nBroil in the preheated oven until fish flakes easily with a fork, 6 to 8 minutes. Serve with lemon wedges."}, {"title": "Easy Lasagna", "image_path": "Images\\Easy_Lasagna.jpg", "ingredients": ["1 pound lean ground beef", "1 (32 ounce) jar spaghetti sauce", "32 ounces cottage cheese", "3 cups shredded mozzarella cheese, divided", "2 eggs", "0.5 cup grated Parmesan cheese", "2 teaspoons dried parsley", "salt to taste", "ground black pepper to taste", "9 lasagna noodles", "0.5 cup water"], "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 8 to 10 minutes. Drain and discard grease. Stir in spaghetti sauce and simmer for 5 minutes.\nCombine cottage cheese, 2 cups of mozzarella cheese, eggs, 1/2 of the grated Parmesan cheese, dried parsley, salt, and pepper in a large bowl.\nSpread 3/4 cup of sauce in a 9x13-inch baking dish. Cover with 3 uncooked lasagna noodles, 1 3/4 cups of cheese mixture, and 1/4 cup sauce; repeat layers once more. Top with remaining 3 noodles, sauce, mozzarella, and Parmesan cheese. Pour 1/2 cup water along the edges of the dish. Cover tightly with aluminum foil.\nBake in the preheated oven for 45 minutes. Uncover and bake for an additional 10 minutes. Let stand 10 minutes before serving."}, {"title": "Fish in Foil", "image_path": "Images\\Fish_in_Foil.jpg", "ingredients": ["2 rainbow trout fillets", "1 tablespoon olive oil", "2 teaspoons garlic salt", "1 teaspoon ground black pepper", "2 sheets heavy-duty aluminum foil", "1 fresh jalapeno pepper, sliced", "1 lemon, sliced"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nRinse and pat fillets dry. Rub fillets with olive oil, and season with garlic salt and black pepper. Place each fillet on a large sheet of aluminum foil. Top with jalapeno slices, and squeeze the juice from the ends of the lemon over fillets. Arrange remaining lemon slices on top of fillets.\nCarefully seal all edges of the foil to form enclosed packets. Place packets on a baking sheet.\nBake in the preheated oven until fish flakes easily with a fork, 15 to 20 minutes depending on size of fillets."}, {"title": "Creamy Garlic Pasta", "image_path": "Images\\Creamy_Garlic_Pasta.jpg", "ingredients": ["2 teaspoons olive oil", "4 garlic cloves, minced", "2 tablespoons butter", "3 cups chicken broth, or more as needed", "0.5 teaspoon ground black pepper", "0.25 teaspoon salt", "0.5 pound spaghetti", "1 cup grated Parmesan cheese", "0.75 cup heavy cream", "1.5 tablespoons dried parsley"], "instructions": "Heat olive oil in a medium pan over medium heat. Add garlic and stir until fragrant, 1 to 2 minutes. Add butter and stir constantly until melted. Pour in 3 cups chicken broth; add pepper and salt. Bring to a boil.\nAdd spaghetti and cook, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Add more chicken broth if pasta starts to stick to the pan.\nAdd Parmesan cheese, cream, and parsley and mix until thoroughly combined. Serve immediately."}, {"title": "Simple Garlic Shrimp", "image_path": "Images\\Simple_Garlic_Shrimp.jpg", "ingredients": ["1.5 tablespoons olive oil", "1 pound shrimp, peeled and deveined", "salt to taste", "6 cloves garlic, finely minced", "0.25 teaspoon red pepper flakes", "3 tablespoons lemon juice", "1 tablespoon caper brine", "2 tablespoons cold butter, cut into 4 equal pieces, divided", "0.33333334326744 cup chopped flat-leaf parsley, divided", "1 teaspoon water, or as needed"], "instructions": "Gather all ingredients.\nHeat olive oil in a heavy skillet over high heat until it just begins to smoke. Place shrimp in an even layer on the bottom of the pan and cook for 1 minute without stirring.\nSeason shrimp with salt; cook and stir until shrimp begin to turn pink, about 1 minute.\nAdd garlic and red pepper flakes; cook and stir for 1 minute.\nStir in lemon juice, caper brine, 1 piece of butter, and 1/2 of the parsley; cook until butter has melted, about 1 minute.\nReduce heat to low and stir in remaining 3 pieces butter. Cook and stir until butter has melted, sauce is thick, and shrimp are pink and opaque, 2 to 3 minutes.\nRemove shrimp with a slotted spoon and transfer to a bowl; continue to cook butter sauce, adding water, 1 teaspoon at a time, if too thick, about 2 minutes.\nSeason with salt to taste; serve shrimp topped with the pan sauce and remaining parsley. Enjoy!"}, {"title": "Pesto Pasta with Chicken", "image_path": "Images\\Pesto_Pasta_with_Chicken.jpg", "ingredients": ["1 (16 ounce) package bow tie pasta", "1 teaspoon olive oil", "2 cloves garlic, minced", "2 skinless, boneless chicken breasts, cut into bite-sized pieces", "1 pinch crushed red pepper flakes, or to taste", "0.5 cup pesto sauce", "0.33333334326744 cup oil-packed sun-dried tomatoes, drained and cut into strips"], "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook until al dente, 8 to 10 minutes; drain.\nHeat oil in a large skillet over medium heat. Sauté garlic until tender, then stir in chicken and season with red pepper flakes. Cook until chicken is golden and cooked through.\nCombine pasta, chicken, pesto, and sun-dried tomatoes in a large bowl; toss to coat evenly."}, {"title": "Blackened Chicken", "image_path": "Images\\Blackened_Chicken.jpg", "ingredients": ["0.5 teaspoon paprika", "0.25 teaspoon cayenne pepper", "0.25 teaspoon ground cumin", "0.25 teaspoon dried thyme", "0.125 teaspoon onion powder", "0.125 teaspoon ground white pepper", "0.125 teaspoon salt", "2 skinless, boneless chicken breast halves", "cooking spray"], "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Spray a baking sheet with cooking spray.\nHeat a cast-iron skillet over high heat until it is smoking hot, about 5 minutes.\nWhile the skillet is heating, mix together paprika, cayenne, cumin, thyme, onion powder, white pepper, and salt in a small bowl. Spray chicken breasts on both sides with cooking spray, then coat evenly with spice mixture.\nPlace chicken in the hot pan and cook for 1 minute. Turn, and cook 1 minute on other side. Transfer chicken to the prepared baking sheet.\nBake in the preheated oven until chicken is no longer pink in the center and the juices run clear, about 5 minutes."}, {"title": "Linguine with Clam Sauce", "image_path": "Images\\Linguine_with_Clam_Sauce.jpg", "ingredients": ["1 (16 ounce) package linguini pasta", "2 (6.5 ounce) cans minced clams, with juice", "0.5 cup vegetable oil", "0.25 cup butter", "1 tablespoon dried parsley", "0.25 tablespoon dried basil", "0.5 teaspoon minced garlic", "ground black pepper to taste"], "instructions": "Bring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes. Drain.\nWhile the pasta is cooking, combine clams with juice, oil, butter, parsley, basil, garlic, and pepper in a large saucepan. Cook over medium heat until boiling.\nServe warm clam sauce over pasta."}, {"title": "Baked Haddock", "image_path": "Images\\Baked_Haddock.jpg", "ingredients": ["0.75 cup milk", "2 teaspoons salt", "0.75 cup bread crumbs", "0.25 cup grated Parmesan cheese", "0.25 teaspoon ground dried thyme", "4 haddock fillets", "0.25 cup butter, melted"], "instructions": "Preheat oven to 500 degrees F (260 degrees C).\nIn a small bowl, combine the milk and salt. In a separate bowl, mix together the bread crumbs, Parmesan cheese, and thyme.\nDip the haddock fillets in the milk, then press into the crumb mixture to coat. Place haddock fillets in a glass baking dish, and drizzle with melted butter.\nBake on the top rack of the preheated oven until the fish flakes easily, about 15 minutes."}, {"title": "Honey Glazed Chicken", "image_path": "Images\\Honey_Glazed_Chicken.jpg", "ingredients": ["0.25 cup honey", "2 tablespoons soy sauce", "0.125 teaspoon red pepper flakes", "1.5 tablespoons olive oil", "2 skinless, boneless chicken breast halves, cut into bite-size pieces"], "instructions": "Gather all ingredients.\nWhisk honey, soy sauce, and red pepper flakes in a bowl; set aside.\nHeat olive oil in a skillet over medium heat; cook and stir chicken in hot oil until lightly brown, about 5 minutes.\nPour honey mixture into the skillet; continue to cook and stir until chicken is no longer pink in the center and sauce is thickened, about 5 minutes more.\nServe hot and enjoy!"}, {"title": "Sweet and Sour Meatballs", "image_path": "Images\\Sweet_and_Sour_Meatballs.jpg", "ingredients": ["1 pound ground beef", "1 cup dry bread crumbs", "1 onion, chopped", "1 egg", "salt and pepper to taste", "1 cup brown sugar", "1 cup water", "0.5 cup ketchup", "0.5 cup cider vinegar", "2 tablespoons soy sauce", "2 tablespoons cornstarch"], "instructions": "Make meatballs: Mix beef, bread crumbs, onion, egg, salt, and pepper together in a large bowl until well combined.\nShape mixture into 1 1/2-inch diameter balls.\nCook meatballs in a large nonstick skillet over medium heat until evenly browned and cooked through.\nMake sauce: Mix brown sugar, water, ketchup, vinegar, soy sauce, and cornstarch together in a medium bowl until smooth.\nPour sauce over meatballs. Reduce heat to low and simmer until sauce is thick, 3 to 5 minutes.\nServe hot and enjoy!"}, {"title": "Honey Walnut Shrimp", "image_path": "Images\\Honey_Walnut_Shrimp.jpg", "ingredients": ["1 cup water", "0.66666668653488 cup white sugar", "0.5 cup walnuts", "4 large egg whites", "0.66666668653488 cup mochiko (glutinous rice flour)", "1 cup vegetable oil for frying", "1 pound large shrimp, peeled and deveined", "0.25 cup mayonnaise", "2 tablespoons honey", "1 tablespoon canned sweetened condensed milk"], "instructions": "Stir together water and sugar in a small saucepan over high heat. Bring to a boil and add walnuts. Boil for 2 minutes, then drain and place walnuts on a cookie sheet to dry.\nWhip egg whites in a medium bowl until foamy. Stir in mochiko until it has a pasty consistency.\nHeat oil in a heavy deep skillet over medium-high heat.\nDip shrimp in mochiko batter, then fry in batches in hot oil until golden brown, about 5 minutes. Remove with a slotted spoon and drain on paper towels.\nStir together mayonnaise, honey, and sweetened condensed milk in a medium serving bowl. Add fried shrimp and toss to coat with sauce. Sprinkle candied walnuts on top and serve."}, {"title": "Sirloin Steak with Garlic Butter", "image_path": "Images\\Sirloin_Steak_with_Garlic_Butter.jpg", "ingredients": ["0.5 cup butter", "4 cloves garlic, minced", "2 teaspoons garlic powder", "4 pounds beef top sirloin steaks", "salt and pepper to taste"], "instructions": "Preheat an outdoor grill for high heat and lightly oil the grate.\nMelt butter in a small saucepan over medium-low heat; stir in minced garlic and garlic powder. Set aside.\nSeason both sides of each steak with salt and pepper.\nPlace steaks on preheated grill and cook 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C) for medium doneness.\nTransfer steaks to warmed plates; brush the tops liberally with garlic butter and allow to rest for 2 to 3 minutes before serving."}, {"title": "Chicago-Style Hot Dog", "image_path": "Images\\Chicago-Style_Hot_Dog.jpg", "ingredients": ["1 all-beef hot dog", "1 poppy seed hot dog bun", "1 tablespoon yellow mustard", "1 tablespoon sweet green pickle relish", "1 tablespoon chopped onion", "4 tomato wedges", "1 dill pickle spear", "2 sport peppers", "1 dash celery salt"], "instructions": "Bring a pot of water to a boil over high heat. Reduce heat to low, place hot dog in water, and cook until warmed through, about 5 minutes. Remove hot dog from water and set aside.\nPlace a steamer basket into the pot and steam poppy seed bun until warm, about 2 minutes.\nPlace hot dog in steamed bun. Pile on toppings in this order: mustard, relish, onion, tomato, pickle, peppers, and celery salt. The tomato wedges should be nestled between hot dog and top of bun on one side. Place pickle between hot dog and bottom of bun on the other side. Don't even think about ketchup!"}, {"title": "Easy 5-Ingredient Salmon", "image_path": "Images\\Easy_5-Ingredient_Salmon.jpg", "ingredients": ["1 tablespoon garlic powder", "1 tablespoon dried basil", "0.5 teaspoon salt", "4 (6 ounce) fillets salmon", "2 tablespoons butter", "4 lemon wedges"], "instructions": "Stir garlic powder, basil, and salt together in a small bowl. Rub the mixture evenly over salmon.\nMelt butter in a large skillet over medium heat. Add salmon and cook until browned and flaky, about 5 minutes per side.\nServe salmon with lemon wedges."}, {"title": "Spicy Grilled Shrimp", "image_path": "Images\\Spicy_Grilled_Shrimp.jpg", "ingredients": ["1 large clove garlic", "1 teaspoon coarse salt", "1 teaspoon paprika", "0.5 teaspoon cayenne pepper", "2 tablespoons olive oil", "2 teaspoons lemon juice", "2 pounds large shrimp, peeled and deveined", "8 wedges lemon, for garnish"], "instructions": "Preheat a grill for medium heat.\nCrush garlic and salt together in a small bowl with a fork. Mix in paprika and cayenne. Stir in olive oil and lemon juice to form a paste.\nCombine garlic paste and shrimp in a large bowl and toss until shrimp are evenly coated.\nLightly oil the grill grate. Grill shrimp until opaque, 2 to 3 minutes per side. Transfer to a serving dish, garnish with lemon wedges, and serve."}, {"title": "Baked Fresh Rainbow Trout", "image_path": "Images\\Baked_Fresh_Rainbow_Trout.jpg", "ingredients": ["2 teaspoons olive oil, divided", "2 whole rainbow trout, gutted and cleaned, heads and tails still on", "0.25 teaspoon dried dill weed", "0.25 teaspoon dried thyme", "salt to taste", "0.5 large onion, sliced", "2 thin slices lemon", "2 tablespoons hot water", "ground black pepper to taste"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish with 1 teaspoon olive oil.\nPlace trout in the prepared baking dish and coat with remaining olive oil. Gather the seasoning ingredients.\nSeason inside and outside of fish with dill, thyme, and salt. Stuff each fish with onion slices; grind pepper on top. Place 1 lemon slice on each fish.\nBake in the preheated oven for 10 minutes; add hot water to dish. Continue baking until fish flakes easily with a fork, about 10 minutes more.\nServe hot and enjoy!"}, {"title": "Crab Legs with Garlic Butter Sauce", "image_path": "Images\\Crab_Legs_with_Garlic_Butter_Sauce.jpg", "ingredients": ["1 pound Snow Crab clusters, thawed if necessary", "0.25 cup butter", "1 clove garlic, minced", "1.5 teaspoons dried parsley", "0.25 teaspoon freshly ground black pepper", "0.125 teaspoon salt"], "instructions": "Cut a slit, length-wise, into the shell of each piece of crab.\nMelt butter in a large skillet over medium heat. Add garlic and cook until translucent, 1 to 2 minutes. Stir in parsley, pepper, and salt. Continue to heat mixture until bubbling.\nAdd crab legs to the skillet; toss to coat with butter mixture. Simmer until completely heated through, 5 to 6 minutes.\nServe hot and enjoy!"}, {"title": "Baked Chicken Schnitzel", "image_path": "Images\\Baked_Chicken_Schnitzel.jpg", "ingredients": ["1 tablespoon olive oil, or as desired", "6 chicken breasts, cut in half lengthwise (butterflied)", "salt and ground black pepper to taste", "0.75 cup all-purpose flour", "1 tablespoon ground paprika", "2 large eggs, beaten", "2 cups seasoned bread crumbs", "1 large lemon, zested"], "instructions": "Gather all ingredients.\nPreheat the oven to 425 degrees F (220 degrees C). Line a large baking sheet with aluminum foil and drizzle olive oil over foil. Place the baking sheet in the oven as it preheats.\nMeanwhile, place chicken breasts between 2 sheets of plastic wrap on a solid, level surface. Firmly pound with the smooth side of a meat mallet to 1/4-inch thickness. Season both sides with salt and pepper.\nMix flour and paprika together in a shallow bowl. Whisk eggs, salt, and pepper together in a second shallow bowl. Mix bread crumbs and lemon zest together in a third shallow bowl.\nDredge one piece of chicken in flour; shake off excess. Dip into beaten egg. Lift up so excess egg drips back in the bowl. Press into bread crumbs to coat both sides. Place the breaded chicken, unstacked, onto a plate. Repeat with remaining chicken.\nRemove the baking sheet from the oven. Arrange chicken in a single layer on the hot sheet. Drizzle more olive oil over each piece.\nBake in the preheated oven for 5 to 6 minutes. Flip chicken and continue baking until no longer pink in the center and the breading is lightly browned, 5 to 6 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."}, {"title": "Heavenly Halibut", "image_path": "Images\\Heavenly_Halibut.jpg", "ingredients": ["0.5 cup grated Parmesan cheese", "0.25 cup butter, softened", "3 tablespoons mayonnaise", "3 tablespoons chopped green onions", "2 tablespoons lemon juice", "0.25 teaspoon salt", "1 dash hot pepper sauce", "2 pounds skinless halibut fillets"], "instructions": "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Grease a rimmed baking sheet; place halibut fillets on the sheet.\nBroil in the preheated oven until fish flakes easily with a fork, about 8 minutes.\nMeanwhile, mix Parmesan cheese, butter, mayonnaise, green onions, lemon juice, salt, and hot pepper sauce in a bowl.\nRemove fillets from the oven; spread Parmesan mixture over top. Return to the oven and broil until topping is bubbly and lightly browned, about 2 more minutes.\nServe hot and enjoy!"}, {"title": "Baked Flounder with Panko and Parmesan", "image_path": "Images\\Baked_Flounder_with_Panko_and_Parmesan.jpg", "ingredients": ["4 (4 ounce) flounder fillets", "4 tablespoons butter, melted, divided", "1 cup panko bread crumbs", "0.66666668653488 cup grated Parmesan cheese", "0.5 teaspoon salt", "1 pinch dried thyme", "ground black pepper to taste"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Lightly grease a large, shallow baking dish.\nLay flounder fillets in the prepared baking dish and brush with 1 tablespoon butter.\nCombine remaining 3 tablespoons butter with bread crumbs, Parmesan cheese, salt, thyme, and pepper in a bowl; sprinkle over flounder and pat down lightly.\nBake in the preheated oven until fish flakes easily with a fork, 15 to 20 minutes.\nCarefully transfer fillets to a plate with a thin spatula."}, {"title": "Classic Cuban-Style Picadillo", "image_path": "Images\\Classic_Cuban-Style_Picadillo.jpg", "ingredients": ["1 tablespoon olive oil", "1 small onion, chopped", "0.5 green bell pepper, chopped", "1 clove garlic, minced, or more to taste", "1 pound lean ground beef", "1 (8 ounce) can tomato sauce", "6 large pitted green olives, quartered", "0.5 cup raisins", "1 tablespoon capers", "2 (1.41 ounce) packages sazon seasoning (such as Goya®)", "1 tablespoon ground cumin", "1 teaspoon white sugar", "salt to taste"], "instructions": "Gather all ingredients.\nHeat olive oil in a skillet over medium heat; cook and stir onion, bell pepper, and garlic, onion in the hot oil until softened, 5 to 7 minutes.\nAdd ground beef into the skillet; cook and stir until crumbly and completely browned, 7 to 10 minutes.\nStir tomato sauce, olives, raisins, capers, cumin, sazon seasoning, sugar, and salt into the ground beef mixture. Cover the skillet, reduce heat to low, and cook until the mixture is heated through, 5 to 10 minutes."}, {"title": "Crispy Panko Chicken Breasts", "image_path": "Images\\Crispy_Panko_Chicken_Breasts.jpg", "ingredients": ["1 pound boneless skinless chicken breasts", "1 egg", "1 cup panko crumbs", "0.5 teaspoon Spice Islands® Garlic Powder", "0.5 teaspoon Spice Islands® Onion Powder", "0.5 teaspoon Spice Islands® Fine Grind Sea Salt", "0.25 teaspoon Spice Islands® Fine Grind Black Pepper", "0.25 cup Mazola® Corn Oil"], "instructions": "Pound chicken breasts, one at a time, in a resealable plastic bag until about 1/2-inch thick.\nLightly beat egg in a shallow bowl. Combine panko crumbs, garlic powder, onion powder, salt, and pepper in a separate shallow bowl.\nDip chicken breasts in egg until coated, then dip in panko mixture, pressing chicken into the crumbs until fully coated. Arrange in a single layer on a plate.\nHeat oil in a large skillet over medium-high heat. Add chicken and cook until golden brown and cooked through, about 2 to 3 minutes per side."}, {"title": "Best Ever Crab Cakes", "image_path": "Images\\Best_Ever_Crab_Cakes.jpg", "ingredients": ["1 egg", "3 tablespoons mayonnaise", "1 tablespoon minced green onions", "4 teaspoons lemon juice", "1 teaspoon dried tarragon", "0.125 teaspoon red pepper flakes", "8 ounces crabmeat", "0.5 cup crushed buttery round crackers", "1 tablespoon butter"], "instructions": "Whisk egg, mayonnaise, green onions, lemon juice, tarragon, and pepper flakes together in a medium bowl. Gently stir in crabmeat, being careful not to break up meat. Gradually mix in cracker crumbs, adding until desired consistency is achieved. Form crab mixture into 4 patties.\nHeat butter in a skillet over medium heat.\nCook patties in the skillet until golden brown, 5 to 6 minutes on each side."}, {"title": "Baby Spinach Omelet", "image_path": "Images\\Baby_Spinach_Omelet.jpg", "ingredients": ["2 eggs", "1 cup torn baby spinach leaves", "1.5 tablespoons grated Parmesan cheese", "0.25 teaspoon onion powder", "0.125 teaspoon ground nutmeg", "salt and pepper to taste"], "instructions": "Beat eggs in a bowl, and stir in baby spinach and Parmesan cheese. Season with onion powder, nutmeg, salt, and pepper.\nSpray a small skillet with cooking spray and place over medium heat. Once warm, add in the egg mixture and cook until partially set, about 3 minutes. Flip with a spatula, and continue cooking, 2 to 3 minutes.\nReduce heat to low and continue cooking, 2 to 3 minutes, or until omelet reaches desired doneness."}, {"title": "Quick and Easy Chicken Spaghetti", "image_path": "Images\\Quick_and_Easy_Chicken_Spaghetti.jpg", "ingredients": ["1 (12 ounce) package angel hair pasta", "2 cups chopped cooked chicken breast", "1 (10.75 ounce) can condensed cream of chicken soup", "1 (10 ounce) can diced tomatoes with green chile peppers", "0.75 (8 ounce) package processed cheese, cubed", "0.5 (4 ounce) jar sliced mushrooms, drained", "salt and pepper to taste"], "instructions": "Bring a large pot of lightly salted water to a boil. Cook angel hair pasta in the boiling water, stirring occasionally, until tender yet firm to the bite, 4 to 5 minutes. Drain pasta and return it to the pot.\nAdd chopped chicken, condensed soup, diced tomatoes with chile peppers, processed cheese, mushrooms, salt, and pepper.\nCook and stir over low heat until cheese is melted and mixture is heated through, about 5 minutes."}, {"title": "Baked Salmon Fillets Dijon", "image_path": "Images\\Baked_Salmon_Fillets_Dijon.jpg", "ingredients": ["4 (4 ounce) fillets salmon", "3 tablespoons prepared Dijon-style mustard", "salt and ground black pepper to taste", "0.25 cup Italian-style dry bread crumbs", "0.25 cup butter, melted"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Line a shallow baking pan with aluminum foil.\nPlace salmon fillets skin-side down on the prepared baking pan. Spread a thin layer of mustard on top of each fillet; season with salt and pepper. Top with bread crumbs, then drizzle with melted butter.\nBake in the preheated oven until salmon flakes easily with a fork, about 15 minutes."}, {"title": "Scrumptious Salmon Cakes", "image_path": "Images\\Scrumptious_Salmon_Cakes.jpg", "ingredients": ["2 (14.75 ounce) cans salmon, drained and flaked", "0.75 cup Italian-seasoned panko (Japanese bread crumbs)", "0.5 cup minced fresh parsley", "2 eggs, beaten", "2 green onions, chopped", "3 tablespoons Worcestershire sauce", "3 tablespoons grated Parmesan cheese", "2 tablespoons Dijon mustard", "2 tablespoons creamy salad dressing (such as Miracle Whip®)", "2 teaspoons seafood seasoning (such as Old Bay®)", "1.5 teaspoons garlic powder", "1.5 teaspoons ground black pepper", "1 tablespoon olive oil, or as needed, divided"], "instructions": "Mix together salmon, panko, parsley, eggs, green onions, Worcestershire sauce, Parmesan cheese, Dijon mustard, creamy salad dressing, seafood seasoning, garlic powder, and pepper in a large bowl. Divide mixture and shape into 8 patties.\nHeat enough olive oil in a large skillet to cover the cooking surface over medium heat. Fry salmon patties in batches until browned, 5 to 7 minutes per side. Repeat with more olive oil as needed."}, {"title": "Super Easy Chicken and Dumplings", "image_path": "Images\\Super_Easy_Chicken_and_Dumplings.jpg", "ingredients": ["2 (10.5 ounce) cans condensed cream of chicken soup", "3 (14 ounce) cans chicken broth", "3 cups shredded cooked chicken meat", "2 (10 ounce) cans refrigerated biscuit dough"], "instructions": "Stir condensed soup, chicken broth, and shredded chicken together in a large saucepan over medium-high heat until it begins to simmer.\nCut each biscuit into quarters, and gently stir into the simmering soup.\nReduce heat to medium-low, cover, and simmer until biscuits are no longer doughy in the center, 10 to 15 minutes."}, {"title": "Sesame-Seared Tuna", "image_path": "Images\\Sesame-Seared_Tuna.jpg", "ingredients": ["0.25 cup soy sauce", "2 tablespoons sesame oil", "1 tablespoon mirin (Japanese sweet wine)", "1 tablespoon honey", "1 tablespoon rice wine vinegar", "0.5 cup sesame seeds", "4 (6 ounce) tuna steaks", "1 tablespoon olive oil", "wasabi paste"], "instructions": "Stir together soy sauce, sesame oil, mirin, and honey in a small bowl. Pour half into a separate small bowl, stir in rice wine vinegar, and set it aside as a dipping sauce.\nSpread sesame seeds out on a plate. Coat tuna steaks with remaining soy sauce mixture, then press into sesame seeds to coat.\nHeat olive oil in a cast iron skillet over high heat until very hot. Place steaks in the pan; sear for about 30 seconds on each side. Serve with dipping sauce and wasabi paste."}, {"title": "Parmesan Crusted Tilapia Fillets", "image_path": "Images\\Parmesan_Crusted_Tilapia_Fillets.jpg", "ingredients": ["0.75 cup grated Parmesan cheese", "1 tablespoon chopped fresh parsley", "2 teaspoons paprika", "salt and ground black pepper to taste", "4 tilapia fillets", "1 drizzle olive oil"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nWhisk Parmesan cheese, parsley, paprika, salt, and pepper together in a shallow dish.\nCoat tilapia fillets with olive oil and press into the Parmesan cheese mixture. Arrange coated fillets on the prepared baking sheet.\nBake in the preheated oven until the fish flakes easily with a fork, 10 to 12 minutes."}, {"title": "Blackened Fish", "image_path": "Images\\Blackened_Fish.jpg", "ingredients": ["1 tablespoon paprika", "2 teaspoons dry mustard", "1 teaspoon cayenne pepper", "1 teaspoon ground cumin", "1 teaspoon black pepper", "1 teaspoon white pepper", "1 teaspoon dried thyme", "1 teaspoon salt", "1 cup unsalted butter, melted, divided", "6 (4 ounce) fillets trout"], "instructions": "Mix together paprika, dry mustard, cayenne pepper, cumin, black pepper, white pepper, thyme, and salt in a small bowl.\nHeat a heavy cast iron pan on high heat until extremely hot, about 10 minutes.\nWhile the pan is heating, pour 3/4 cup melted butter into a shallow dish. Dip each fillet into butter, turning once to coat both sides. Sprinkle both sides of fillets with spice mixture; gently pat mixture onto fish.\nWorking in batches, place fillets into the hot pan without crowding. Carefully pour about 1 teaspoon melted butter over each fillet. Cook until fish has a charred bottom, about 2 minutes. Turn fillets and spoon about 1 teaspoon melted butter over each. Continue cooking until bottoms are charred, 1 to 2 minutes. Repeat with remaining fish."}, {"title": "Savory Sea Scallops and Angel Hair Pasta", "image_path": "Images\\Savory_Sea_Scallops_and_Angel_Hair_Pasta.jpg", "ingredients": ["1 (16 ounce) package angel hair pasta", "0.25 cup butter", "2 cloves garlic, minced", "2 pounds sea scallops, rinsed and patted dry", "3 tablespoons chopped fresh basil", "2 tablespoons chopped fresh flat-leaf parsley", "2 tablespoons fresh lemon juice", "salt and freshly ground black pepper to taste", "0.5 cup heavy cream", "1 tablespoon grated Parmesan cheese to taste"], "instructions": "Bring a large pot of lightly salted water to a boil. Add angel hair pasta and cook, uncovered, for 4 to 5 minutes or until al dente; drain.\nWhile pasta is cooking, melt butter in a large skillet over medium heat. Stir in garlic and cook just until fragrant and softened, about 1 minute.\nSlice any scallops over 3/4-inch thick in half so they'll cook evenly.\nStir scallops, basil, and parsley into the skillet. Cook and gently stir just until scallops feel slightly firm when pressed with a finger, about 2 to 3 minutes. Scallops will become tough and chewy if overcooked.\nReduce heat to low; stir in lemon juice and season with salt and pepper. Pour in cream if you like a thicker sauce and cook just until the sauce begins to simmer.\nLadle scallops and sauce over hot pasta and sprinkle Parmesan cheese over top."}, {"title": "Japanese-Style Deep-Fried Shrimp", "image_path": "Images\\Japanese-Style_Deep-Fried_Shrimp.jpg", "ingredients": ["1 pound medium shrimp, peeled (tails left on) and deveined", "0.5 teaspoon salt", "0.5 teaspoon ground black pepper", "0.5 teaspoon garlic powder", "1 cup all-purpose flour", "1 teaspoon paprika", "2 large eggs, beaten", "1 cup panko crumbs", "1 quart vegetable oil for frying"], "instructions": "Place shrimp in a bowl and season with salt, pepper, and garlic powder. Mix flour and paprika together in a shallow bowl. Place eggs in a second bowl and panko in a third bowl.\nHeat oil in a deep fryer or deep skillet to 375 degrees F (190 degrees C).\nDip each shrimp into flour mixture, then into egg, and finally into panko crumbs to coat.\nFry a few shrimp at a time in the hot oil until golden brown, about 5 minutes. Remove with a slotted spoon and drain on paper towels before serving."}, {"title": "Quick Chicken Piccata", "image_path": "Images\\Quick_Chicken_Piccata.jpg", "ingredients": ["4 skinless, boneless chicken breast halves", "cayenne pepper to taste", "salt and ground black pepper to taste", "all-purpose flour for dredging", "2 tablespoons olive oil", "1 tablespoon capers, drained", "0.5 cup white wine", "0.25 cup fresh lemon juice", "0.25 cup water", "3 tablespoons cold unsalted butter, cut in 1/4-inch slices", "2 tablespoons chopped fresh Italian parsley"], "instructions": "Place chicken breasts between 2 sheets of heavy plastic on a solid, level surface. Firmly pound chicken breasts with the smooth side of a meat mallet to a 1/2-inch thickness.\nSeason both sides of chicken breasts with cayenne, salt, and black pepper; dredge lightly in flour and shake off any excess.\nHeat olive oil in a skillet over medium-high heat. Place chicken in the pan, reduce heat to medium, and cook until browned and cooked through, about 5 minutes per side; transfer to a plate.\nCook capers in reserved oil, smashing them lightly to release brine, until warmed through, about 30 seconds. Pour white wine into the skillet and bring to a boil while scraping the browned bits of food off the bottom of the pan with a wooden spoon. Cook until reduced by half, about 2 minutes.\nStir lemon juice, water, and butter into the reduced wine mixture; cook and stir continuously to form a thick sauce, about 2 minutes. Reduce heat to low and stir parsley through the sauce.\nReturn chicken breasts to the pan and cook until heated through, 1 to 2 minutes. Serve with sauce spooned over the top."}, {"title": "Beer Batter Fish Made Great", "image_path": "Images\\Beer_Batter_Fish_Made_Great.jpg", "ingredients": ["2 quarts vegetable oil for frying", "8 (4 ounce) fillets cod", "salt and pepper to taste", "1 cup all-purpose flour", "2 tablespoons garlic powder", "2 tablespoons paprika", "2 teaspoons salt", "2 teaspoons ground black pepper", "1 egg, beaten", "1 (12 fluid ounce) can or bottle beer, or as needed"], "instructions": "Heat oil in a deep fryer to 365 degrees F (185 degrees C). Rinse cod fillets, pat dry, and season with salt and pepper.\nMix flour, garlic powder, paprika, salt, and pepper in a large bowl; add egg and stir well to combine. Gradually mix in enough beer to make a thin batter.\nDip cod fillets into the batter to coat. Carefully lower fillets, one at a time, into the hot oil. Fry several fillets at a time, turning once, until cooked through and golden brown, about 2 minutes per side. Drain on paper towels. Repeat to cook remaining fillets. Serve warm."}, {"title": "Air Fryer Tilapia with Fresh Lemon Pepper", "image_path": "Images\\Air_Fryer_Tilapia_with_Fresh_Lemon_Pepper.jpg", "ingredients": ["4 (6 ounce) tilapia fillets", "2 tablespoons lemon zest", "2 tablespoons olive oil", "2 cloves garlic, minced", "1.5 teaspoons coarsely ground black peppercorns", "0.5 teaspoon salt", "1 pinch paprika, or to taste", "cooking spray", "1 sprig parsley, chopped, or more to taste", "4 wedges lemon"], "instructions": "Preheat the air fryer to 400 degrees F (200 degrees C) for 3 minutes.\nMeanwhile, rinse tilapia fillets and pat dry with a paper towel.\nMix together lemon zest, olive oil, garlic, pepper, and salt in a small bowl until well combined. Rub over tops of fillets, then sprinkle lightly with paprika. Lightly coat the air fryer basket with cooking spray. Arrange fillets evenly in the basket, spice-side up. Do not crowd; if needed, cook in batches.\nCook in the preheated air fryer until fish flakes easily with a fork, 7 to 10 minutes. Remove fillets to a plate and garnish with parsley. Serve with lemon wedges."}, {"title": "Blackened Salmon Fillets", "image_path": "Images\\Blackened_Salmon_Fillets.jpg", "ingredients": ["2 tablespoons ground paprika", "1 tablespoon ground cayenne pepper", "1 tablespoon onion powder", "2 teaspoons salt", "0.5 teaspoon ground white pepper", "0.5 teaspoon ground black pepper", "0.25 teaspoon dried thyme", "0.25 teaspoon dried basil", "0.25 teaspoon dried oregano", "4 salmon fillets, skin and bones removed", "0.5 cup unsalted butter, melted"], "instructions": "Mix paprika, cayenne pepper, onion powder, salt, white and black pepper, thyme, basil, and oregano together in a small bowl.\nBrush salmon fillets on both sides with 1/4 cup butter, and sprinkle evenly with the spice mixture.\nHeat 2 tablespoons melted butter in a large, heavy skillet over high heat. Add salmon and cook until blackened, 2 to 5 minutes. Lift fillets, add remaining melted butter to the skillet, and flip fillets into the butter. Cook until the other side is blackened and fish flakes easily with a fork, 3 to 5 minutes."}, {"title": "Air Fryer Lobster Tails with Lemon-Garlic Butter", "image_path": "Images\\Air_Fryer_Lobster_Tails_with_Lemon-Garlic_Butter.jpg", "ingredients": ["2 (4 ounce) lobster tails", "4 tablespoons butter", "1 teaspoon lemon zest", "1 clove garlic, grated", "salt and ground black pepper to taste", "1 teaspoon chopped fresh parsley", "2 wedges lemon"], "instructions": "Preheat an air fryer to 380 degrees F (195 degrees C).\nButterfly lobster tails by cutting lengthwise through the centers of the hard top shells and meat with kitchen shears. Cut to, but not through, the bottoms of the shells. Spread tail halves apart. Place tails in the air fryer basket with lobster meat facing up.\nMelt butter in a small saucepan over medium heat. Add lemon zest and garlic; heat until garlic is fragrant, about 30 seconds.\nTransfer 2 tablespoons of butter mixture to a small bowl; brush this onto lobster tails. Discard any remaining brushed butter to avoid contamination from uncooked lobster. Season lobster with salt and pepper.\nCook in the preheated air fryer until lobster meat is opaque, 5 to 7 minutes.\nSpoon reserved butter from the saucepan over lobster meat. Top with parsley and serve with lemon wedges."}, {"title": "Parmesan Crusted Chicken", "image_path": "Images\\Parmesan_Crusted_Chicken.jpg", "ingredients": ["0.5 cup Hellmann's® or Best Foods® Real Mayonnaise", "0.25 cup grated Parmesan cheese", "4 (5 ounce) boneless, skinless chicken breast halves", "4 teaspoons Italian seasoned dry bread crumbs"], "instructions": "Preheat the oven to 425 degrees F (220 degrees C).\nMix mayonnaise and Parmesan cheese together in a medium bowl until well combined.\nArrange chicken breasts on a baking sheet. Evenly top with mayonnaise mixture, then sprinkle with bread crumbs to coat.\nBake in the preheated oven until golden on top and chicken is cooked through, about 20 minutes."}, {"title": "Baked Fish Fillets", "image_path": "Images\\Baked_Fish_Fillets.jpg", "ingredients": ["1 tablespoon vegetable oil, or to taste", "2 pounds mackerel fillets", "1 teaspoon salt", "0.125 teaspoon ground black pepper", "0.25 cup butter, melted", "2 tablespoons lemon juice", "0.125 teaspoon ground paprika"], "instructions": "Gather all ingredients.\nPreheat the oven to 350 degrees F (175 degrees C). Grease a baking pan with vegetable oil.\nPlace mackerel fillets in the baking pan; season with salt and pepper.\nMix butter, lemon juice, and paprika together in a bowl. Pour over mackerel fillets.\nBake in the preheated oven until fish flakes easily with a fork, 20 to 25 minutes."}, {"title": "Crumbed Chicken Tenderloins (Air Fried)", "image_path": "Images\\Crumbed_Chicken_Tenderloins_(Air_Fried).jpg", "ingredients": ["1 large egg", "0.5 cup dry bread crumbs", "2 tablespoons vegetable oil", "8 chicken tenderloins"], "instructions": "Gather all ingredients.\nPreheat an air fryer to 350 degrees F (175 degrees C).\nWhisk egg in a small bowl.\nMix bread crumbs and oil together in a second bowl until mixture becomes loose and crumbly.\nDip each chicken tenderloin into the bowl of egg; shake off any residual egg. Dip chicken into crumb mixture, making sure it is evenly and fully covered.\nLay chicken tenderloins in the air fryer basket in an even layer.\nAir-fry until no longer pink in the center, about 12 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nServe hot and enjoy!"}, {"title": "Old Bay-Seasoned Steamed Shrimp", "image_path": "Images\\Old_Bay-Seasoned_Steamed_Shrimp.jpg", "ingredients": ["0.5 cup water", "0.5 cup white vinegar", "2 tablespoons seafood seasoning (such as Old Bay®)", "1 pound fresh large shrimp, deveined with shells on"], "instructions": "Bring water, vinegar, and seafood seasoning to a boil in a saucepan over high heat. Add shrimp and stir.\nReduce heat to medium, cover, and steam, stirring once or twice, until bright orange in color, 3 to 5 minutes. Drain."}, {"title": "Shrimp Egg Foo Young", "image_path": "Images\\Shrimp_Egg_Foo_Young.jpg", "ingredients": ["8 ounces fresh bean sprouts", "1 cup cooked small shrimp", "4 eggs", "0.33333334326744 cup thinly sliced green onions", "0.25 teaspoon garlic powder", "2 tablespoons vegetable oil", "3 cups chicken broth", "2 tablespoons cornstarch", "2 tablespoons sugar", "2 tablespoons Chinese cooking wine", "2 tablespoons soy sauce"], "instructions": "Mix bean sprouts, shrimp, eggs, green onions, and garlic powder together in a large bowl until well combined.\nHeat oil in a skillet over medium heat. Add about 1/2 cup of egg mixture into the skillet to make a patty. Repeat to add more patties to the skillet. Working in batches, fry patties until golden brown, about 4 minutes per side.\nMeanwhile, make the sauce: Whisk chicken broth, cornstarch, sugar, cooking wine, and soy sauce together in a saucepan over medium-low heat; simmer until sauce thickens, about 5 minutes.\nSpoon sauce over patties."}, {"title": "Crispy Baked Walleye", "image_path": "Images\\Crispy_Baked_Walleye.jpg", "ingredients": ["2 eggs", "1 tablespoon water", "0.33333334326744 cup dry bread crumbs", "0.33333334326744 cup instant mashed potato flakes", "0.33333334326744 cup grated Parmesan cheese", "1 teaspoon seasoned salt", "4 (4 ounce) fillets walleye"], "instructions": "Gather all ingredients.\nPreheat the oven to 450 degrees F (230 degrees C). Grease a baking sheet.\nBeat eggs and water together in a bowl until smooth; set aside.\nCombine bread crumbs, potato flakes, and Parmesan cheese in a separate bowl with seasoned salt until evenly mixed.\nDip walleye fillets into beaten egg, then press into bread crumb mixture. Place onto the prepared baking sheet.\nBake in the preheated oven until fish is opaque in the center and flakes easily with a fork, 15 to 20 minutes."}, {"title": "Sazerac Cocktail", "image_path": "Images2\\Sazerac_Cocktail.jpg", "ingredients": ["ice", "3 dashes Peychaud's Bitters®", "2 dashes Angostura Bitters®", "1 sugar cube", "1 cup ice cubes", "2 fluid ounces rye whiskey", "1 lemon peel"], "instructions": "Fill a rocks glass with 1 cup ice and set aside to chill, about 5 minutes. Discard ice.\nCombine Peychaud's Bitters, Angostura Bitters and sugar cube in a cocktail shaker; mash well with a cocktail muddler. Add 1 cup ice and whiskey. Stir until chilled and strain into the chilled glass.\nTwist a lemon peel over the surface of the cocktail to extract the essence; discard lemon peel."}, {"title": "Stout and Ale", "image_path": "Images2\\Stout_and_Ale.jpg", "ingredients": ["1 (12 fluid ounce) bottle lager beer (such as Harp®)", "1 (12 fluid ounce) can or bottle Irish stout beer (such as Guinness®)"], "instructions": "Divide lager beer evenly between 2 tall beer glasses.\nWorking with one glass at a time, place a large tablespoon, dome-side up, 1 inch or so above lager beer, with the tip of the spoon pointed slightly downward.\nSlowly pour 1/2 of the stout beer over the tablespoon so it gently pours down the side of the glass in a thick trickle. Allow to stand until 2 distinct layers of beer form, 3 to 5 seconds. Repeat with the remaining glass of beer."}, {"title": "Spicy Lemon Ginger Switchel", "image_path": "Images2\\Spicy_Lemon_Ginger_Switchel.jpg", "ingredients": ["1 cup water", "2 tablespoons unfiltered apple cider vinegar", "1 tablespoon fresh lemon juice", "4 teaspoons honey", "1 teaspoon grated fresh ginger", "1 pinch ground cayenne pepper"], "instructions": "Place water, apple cider vinegar, lemon juice, honey, fresh ginger, and cayenne pepper in a glass jar. Stir or shake well to combine."}, {"title": "Spiked Lemonade", "image_path": "Images2\\Spiked_Lemonade.jpg", "ingredients": ["0.5 cup freshly squeezed lemon juice", "0.25 cup warm water", "0.25 cup white sugar", "0.5 cup cold water", "3 (1.5 fluid ounce) jiggers coconut-flavored rum", "ice cubes, as needed"], "instructions": "Place sugar in warm water, stirring until sugar is completely dissolved. Add lemon juice, cold water, and coconut rum. Stir until completely incorporated.\nFill 2 glasses with ice cubes and divide lemon juice mixture amongst both glasses."}, {"title": "Copycat Pink Drink", "image_path": "Images2\\Copycat_Pink_Drink.jpg", "ingredients": ["0.5 cup water", "0.25 cup white grape juice or white cranberry juice", "1 serving wild strawberry sugar-free drink mix (such as Crystal Light)", "1 (2 g) bag hibiscus tea (such as Tazo Passion®)", "2.25 cups refrigerated unsweetened coconut milk", "ice cubes, freeze-dried strawberries, or sliced fresh or frozen strawberries as garnish (optional)"], "instructions": "Pour water, juice, and drink mix into a glass. Stir to dissolve. Add tea bag. Let stand for 5 minutes (it doesn't have to be hot). Remove and discard tea bag.\nFill 2 tall glasses with ice. Add half the strawberry-tea mixture and half the coconut milk to each glass. Stir to combine. Stir in strawberries (if using)."}, {"title": "Limoncello Moscow Mule", "image_path": "Images2\\Limoncello_Moscow_Mule.jpg", "ingredients": ["1 cup ice", "0.5 fluid ounce fresh lime juice", "1.5 fluid ounces limoncello liqueur", "1.5 fluid ounces vodka", "5 ounces ginger beer", "1 thin lemon slice (optional)"], "instructions": "Fill a copper mule mug with ice. Add lime juice, limoncello, and vodka; stir to combine. Top with ginger beer. Lightly stir again and garnish with lemon slice."}, {"title": "Cantaloupe Frenzy", "image_path": "Images2\\Cantaloupe_Frenzy.jpg", "ingredients": ["1 cantaloupe - peeled, seeded and cubed", "3 tablespoons white sugar, or to taste", "2 cups ice cubes"], "instructions": "Place cantaloupe cubes and ice into the container of a blender. Process until the ice is in small pieces. Add sugar, and puree. Pour into tall glasses and serve immediately."}, {"title": "Kombucha Margarita", "image_path": "Images2\\Kombucha_Margarita.jpg", "ingredients": ["2 cups ice", "2 fluid ounces silver tequila", "0.75 fluid ounce triple sec (orange-flavored liqueur)", "0.75 fluid ounce freshly squeezed lime juice", "1 tablespoon coarse salt, or as needed", "1 lime wedge", "3 ounces citrus flavored kombucha, or your favorite flavor"], "instructions": "Fill a cocktail shaker half-full with ice. Add tequila, triple sec, and lime juice to the shaker. Seal and shake vigorously until outside is frosted, 10 to 15 seconds.\nSprinkle salt onto a plate. Moisten the rim of a glass with the lime wedge. Press the moistened rim into the salt. Fill glass with ice.\nStrain margarita into the glass and top with kombucha. Stir gently and garnish with lime wedge, if desired."}, {"title": "Kombucha Mule", "image_path": "Images2\\Kombucha_Mule.jpg", "ingredients": ["1.5 cups ice", "0.5 fluid ounce freshly squeezed lime juice", "2 fluid ounces vodka", "4 ounces ginger-flavored Kombucha (such as KeVita®Master Brew Ginger)", "1 thin lime slice (optional)"], "instructions": "Fill a copper mule mug with ice. Add lime juice and vodka; stir to combine. Top with ginger kombucha. Lightly stir again and garnish with lime slice."}, {"title": "Oyster Shooters", "image_path": "Images2\\Oyster_Shooters.jpg", "ingredients": ["9 fluid ounces tomato juice", "1 teaspoon prepared horseradish", "2 teaspoons freshly ground black pepper", "12 (1.5 fluid ounce) jiggers vodka", "12 shucked oysters", "1 lemon - cut into wedges, for garnish"], "instructions": "Mix tomato juice, horseradish, and pepper in a large bowl until well combined.\nPour 1/2 shot of tomato juice mixture into 12 small glasses. Add a shot of vodka to each glass. Place 1 raw oyster in each glass and garnish with a lemon wedge."}, {"title": "Washington Apple Cocktail", "image_path": "Images2\\Washington_Apple_Cocktail.jpg", "ingredients": ["2 fluid ounces whiskey", "1.5 fluid ounces cranberry juice", "1 fluid ounce sour apple schnapps (such as DeKuyper® Sour Apple Pucker)", "1 teaspoon agave nectar", "ice cubes as needed", "2 apple slices for garnish"], "instructions": "Combine whiskey, cranberry juice, apple schnapps, and agave in a cocktail shaker. Fill cocktail shaker with ice and shake well.\nStrain into frosted martini glasses and garnish with an apple slice."}, {"title": "Ginger-Hibiscus Sparkler", "image_path": "Images2\\Ginger-Hibiscus_Sparkler.jpg", "ingredients": ["0.25 cup dried hibiscus petals", "1.5 cups boiling water", "0.5 cup fresh lime juice", "0.5 cup ginger liqueur (such as Domaine de Canton®)", "0.5 cup ginger beer", "4 sprigs fresh mint for garnish", "fresh ginger, peeled and thinly sliced"], "instructions": "Steep hibiscus flowers in boiling water for 5 minutes; strain into a heatproof bowl set in a bowl of ice to speed cooling. Cool completely.\nTransfer to a small pitcher. Stir in lime juice and ginger liqueur. Pour into ice-filled Collins glasses (about 5 oz. per glass) and top each with 1 oz. ginger beer. Garnish with mint sprigs and ginger slices."}, {"title": "Cape Codder Cocktail", "image_path": "Images2\\Cape_Codder_Cocktail.jpg", "ingredients": ["1.5 fluid ounces vodka", "5 fluid ounces cranberry juice", "1 cup ice cubes", "1 lime wedge for garnish"], "instructions": "Pour vodka and cranberry juice into a highball glass filled with ice; stir well.\nGarnish with a lime wedge."}, {"title": "PB & J Smoothie", "image_path": "Images2\\PB_&_J_Smoothie.jpg", "ingredients": ["6 frozen strawberries, or more to taste", "0.75 cup milk", "1.5 tablespoons peanut butter", "1 tablespoon blue agave nectar, or more to taste", "1 tablespoon flax seeds"], "instructions": "Combine strawberries, milk, peanut butter, blue agave, and flax seeds in a blender and blend until well combined."}, {"title": "Pineapple Margarita", "image_path": "Images2\\Pineapple_Margarita.jpg", "ingredients": ["2 cups ice, or as needed", "3 fluid ounces pineapple juice", "2 fluid ounces silver tequila", "0.75 fluid ounce triple sec", "0.75 fluid ounce freshly squeezed lime juice", "1 tablespoon coarse salt, or as needed", "2 lime wedges", "pineapple wedge for garnish (optional)"], "instructions": "Fill a cocktail shaker half-full with ice. Add pineapple juice, tequila, triple sec, and lime juice to the shaker. Seal and shake vigorously until outside is frosted, 10 to 15 seconds.\nSprinkle salt onto a plate. Moisten the rim of a glass with a lime wedge. Press the moistened rim into the salt. Fill glass with ice.\nStrain margarita into the glass and garnish with pineapple and lime wedge, if desired."}, {"title": "Oolong, Orange, and Whiskey Punch", "image_path": "Images2\\Oolong,_Orange,_and_Whiskey_Punch.jpg", "ingredients": ["3 cups water", "3 tablespoons sugar", "1 (2 inch) cinnamon stick", "2 whole star anise", "6 oolong tea bags", "2.66 cups fresh orange juice", "1.5 cups whiskey", "3 tablespoons fresh lemon juice (from 1 lemon)", "large ice cubes", "tangerine, sectioned and seeded"], "instructions": "Bring water to a boil in a saucepan over high heat. Stir in sugar, cinnamon stick, and star anise. Remove from heat and add tea bags. Let steep for 3 minutes (or according to package directions for strongest tea). Remove tea bags. Let cool to room temperature, about 1 hour. Remove and discard cinnamon stick and star anise.\nStir together tea mixture, orange juice, whiskey, and lemon juice in a punch bowl or pitcher. Chill until cold, about 2 hours or up to overnight.\nGarnish with tangerine slices and additional star anise. Ladle into ice-filled glasses. Top each with a tangerine slice."}, {"title": "Mexican Mocha", "image_path": "Images2\\Mexican_Mocha.jpg", "ingredients": ["2 tablespoons powdered sugar", "1 tablespoon unsweetened cocoa powder", "0.25 teaspoon ground cinnamon", "0.25 teaspoon chili powder", "1 cup hot coffee", "0.25 cup half-and-half creamer", "whipped cream for topping (optional)", "cinnamon for sprinkling (optional)"], "instructions": "Combine powdered sugar, cocoa powder, cinnamon, and chili powder in the bottom of a mug.\nPour hot coffee on top and stir until dissolved. Pour in half-and-half creamer and stir.\nTop with whipped cream and sprinkle with cinnamon, if desired."}, {"title": "Party Punch IV", "image_path": "Images2\\Party_Punch_IV.jpg", "ingredients": ["1 (16 ounce) can frozen pineapple juice concentrate", "1 (12 fluid ounce) can frozen orange juice concentrate", "12 fluid ounces vodka", "2 (2 liter) bottles lemon-lime flavored carbonated beverage, chilled", "1 (4 ounce) jar maraschino cherries", "4 oranges, sliced into rounds", "2 trays ice cubes"], "instructions": "In a punch bowl, combine pineapple juice concentrate, orange juice concentrate and vodka. Pour in lemon-lime soda. Float cherries and orange slices on top. Add ice before serving."}, {"title": "Classic Old Fashioned", "image_path": "Images2\\Classic_Old_Fashioned.jpg", "ingredients": ["2 teaspoons simple syrup", "1 teaspoon water", "2 dashes bitters", "1 cup ice cubes", "1 (1.5 fluid ounce) jigger bourbon whiskey", "1 slice orange", "1 maraschino cherry"], "instructions": "Pour simple syrup, water, and bitters into a whiskey glass; stir to combine. Add ice cubes and pour in bourbon. Garnish with orange slice and maraschino cherry."}, {"title": "The REAL Long Island Iced Tea", "image_path": "Images2\\The_REAL_Long_Island_Iced_Tea.jpg", "ingredients": ["0.5 fluid ounce vodka", "0.5 fluid ounce rum", "0.5 fluid ounce gin", "0.5 fluid ounce tequila", "0.5 fluid ounce triple sec (orange-flavored liqueur)", "1 fluid ounce sweet and sour mix", "1 fluid ounce cola, or to taste", "1 lemon slice"], "instructions": "Gather all ingredients.\nFill a cocktail shaker with ice. Pour vodka, rum, gin, tequila, triple sec, and sour mix over ice; cover and shake.\nPour cocktail into a Collins or hurricane glass; top with splash of cola for color. Garnish with a lemon slice.\nGarnish with lemon slices and mint leaves!"}, {"title": "Moscow Mule Cocktail", "image_path": "Images2\\Moscow_Mule_Cocktail.jpg", "ingredients": ["1.5 fluid ounces vodka", "0.5 fluid ounce lime juice", "ice cubes", "0.5 cup ginger beer", "1 lime wedge for garnish"], "instructions": "Pour vodka and lime juice into a mug; add ice cubes and ginger beer. Stir to combine.\nDrop a lime wedge into the mug for garnish."}, {"title": "The Real Mojito", "image_path": "Images2\\The_Real_Mojito.jpg", "ingredients": ["10 fresh mint leaves", "0.5 medium lime, cut into 3 wedges, divided", "2 tablespoons white sugar, or to taste", "1 cup ice cubes, or as needed", "1.5 fluid ounces white rum", "0.5 cup club soda, or as needed"], "instructions": "Place mint leaves and 1 lime wedge into a sturdy glass. Use a muddler and crush to release mint oils and lime juice.\nAdd remaining lime wedges and 2 tablespoons sugar, and muddle again to release the lime juice. Do not strain the mixture.\nFill the glass almost to the top with ice.\nPour in rum and fill the glass with club soda.\nStir, taste, and add more sugar if desired."}, {"title": "Best Strawberry Daiquiri", "image_path": "Images2\\Best_Strawberry_Daiquiri.jpg", "ingredients": ["4 ounces frozen strawberries", "0.5 cup white sugar", "0.5 cup lemon juice", "0.125 cup lime juice", "0.75 cup rum", "0.25 cup lemon-lime flavored carbonated beverage", "6 cups ice, or as needed"], "instructions": "Gather all ingredients.\nPlace frozen strawberries in a blender; add sugar, lemon juice, and lime juice.\nPour in rum and lemon-lime beverage, then add ice.\nBlend until smooth.\nEnjoy!"}, {"title": "Lemon Drop Shots", "image_path": "Images2\\Lemon_Drop_Shots.jpg", "ingredients": ["0.75 fluid ounce vodka (such as Absolut®)", "0.75 fluid ounce lemon juice", "2.5 teaspoons white sugar, divided, or more to taste", "1 lemon, cut into wedges"], "instructions": "Combine vodka and lemon juice in a shot glass. Sprinkle 1/2 teaspoon sugar on top.\nPlace remaining 2 teaspoons sugar on a small plate; dip lemon wedges in sugar. Suck on a sugared lemon after drinking the shot."}, {"title": "Peanut Butter Banana Smoothie", "image_path": "Images2\\Peanut_Butter_Banana_Smoothie.jpg", "ingredients": ["2 bananas, broken into chunks", "2 cups milk", "0.5 cup peanut butter", "2 tablespoons honey, or to taste", "2 cups ice cubes"], "instructions": "Gather all ingredients.\nPlace bananas, milk, peanut butter, honey, and ice cubes in a blender.\nBlend until smooth, about 30 seconds.\nEnjoy!"}, {"title": "Bahama Mama", "image_path": "Images2\\Bahama_Mama.jpg", "ingredients": ["1 cup crushed ice", "1 fluid ounce orange juice", "1 fluid ounce pineapple juice", "0.5 fluid ounce rum", "0.5 fluid ounce coconut-flavored rum", "0.5 fluid ounce grenadine syrup"], "instructions": "Combine crushed ice, orange juice, pineapple juice, regular rum, coconut-flavored rum, and grenadine in a blender. Blend until the drink's consistency is slushy."}, {"title": "Simple Syrup", "image_path": "Images2\\Simple_Syrup.jpg", "ingredients": ["1 cup white sugar", "1 cup water"], "instructions": "Combine sugar and water in a medium saucepan over medium heat; bring to a boil, stirring, until sugar has dissolved. Allow to cool.\nPour into a clean jar and seal with a tight-fitting lid; store in the refrigerator for up to one month."}, {"title": "Panna Cotta", "image_path": "Images2\\Panna_Cotta.jpg", "ingredients": ["0.33333334326744 cup skim milk", "1 (.25 ounce) envelope unflavored gelatin", "2.5 cups heavy cream", "0.5 cup white sugar", "1.5 teaspoons vanilla extract"], "instructions": "Pour milk into a small bowl. Sprinkle gelatin powder over milk and stir until combined. Set aside.\nStir heavy cream and sugar together in a saucepan. Set over medium heat and bring to a boil; watch carefully as the cream can quickly bubble up and boil over.\nImmediately stir gelatin mixture into boiling cream, stirring until completely dissolved. Cook and stir for 1 minute.\nRemove the pan from the heat and stir in vanilla.\nPour cream mixture into 6 individual ramekins. Leave to cool, uncovered, until no longer warm, about 20 minutes.\nWhen cool, cover with plastic wrap. Refrigerate until set, at least 4 hours but preferably overnight."}, {"title": "Steamed Plum Pudding", "image_path": "Images2\\Steamed_Plum_Pudding.jpg", "ingredients": ["0.25 cup butter", "0.33333298563957 cup brown sugar", "1 cup milk", "12 dates, pitted and chopped", "0.5 cup raisins", "0.25 cup dried currants", "0.25 cup candied mixed fruit peel, chopped", "1 orange, zested", "1 teaspoon baking soda", "1 cup self-rising flour", "2 teaspoons ground cinnamon", "1 pinch salt"], "instructions": "Generously grease a pudding mold.\nIn a large saucepan combine butter, sugar, milk, dates, raisins, currants, mixed fruit peel and zest of the orange; bring to a boil. Remove from heat and stir in baking soda. Sift in the flour, cinnamon and salt; mix gently until blended. Pour into prepared pudding mold.\nCover with a double layer of greased wax paper and steam for 2 hours."}, {"title": "Homemade Pound Cake", "image_path": "Images2\\Homemade_Pound_Cake.jpg", "ingredients": ["3.25 cups white sugar", "0.75 pound unsalted butter, at room temperature", "6 extra large eggs, at room temperature", "2 teaspoons pure vanilla extract", "3 cups all-purpose flour", "0.5 teaspoon baking powder", "0.5 teaspoon salt", "0.25 teaspoon ground nutmeg", "1 cup 1% milk"], "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a 12-cup fluted tube pan (such as Bundt).\nCream sugar and butter in a large mixing bowl on medium speed until light and fluffy, about 5 minutes. Add eggs, one at a time, beating for 45 seconds after each addition. Add vanilla extract and beat for 30 seconds.\nCombine flour, baking powder, salt, and nutmeg in a medium bowl. Add 1/2 of the flour mixture to the butter mixture and mix on low speed until just blended. Add 1/2 cup milk and beat on low speed until just blended. Scrape the sides of the bowl with a spatula between each addition. Repeat with remaining flour mixture and milk.\nPour batter into the prepared baking pan, filling no more than 2/3 full. Smooth the top with a spoon or a spatula.\nBake in the preheated oven until a toothpick inserted into the center comes out clean and the cake is just starting to pull away from the sides of the pan, about 1 hour and 25 minutes.\nRemove from the oven and allow to cool for about 15 minutes before inverting onto a plate. Allow to cool completely before serving."}, {"title": "Easy Vanilla Cake", "image_path": "Images2\\Easy_Vanilla_Cake.jpg", "ingredients": ["cooking spray", "2.6666667461395 cups all-purpose flour, or more as needed", "1 cup white sugar", "1 tablespoon baking powder", "1 tablespoon vanilla extract", "2 pinches salt", "3 eggs", "0.75 cup milk", "0.75 cup vegetable oil"], "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch cake tin with cooking spray and line with parchment paper.\nMix flour, sugar, baking powder, vanilla extract, and salt together in a large bowl. Add eggs, milk, and vegetable oil; mix by hand or beat with an electric mixer on low speed until smooth. Add more flour if batter is too runny. Pour into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, about 1 hour. Cool on a wire rack for 5 minutes. Run a table knife around the edges to loosen. Invert cake carefully onto a cooling rack. Let cool completely."}, {"title": "Easy Key Lime Pie", "image_path": "Images2\\Easy_Key_Lime_Pie.jpg", "ingredients": ["5 egg yolks, beaten", "1 (14 ounce) can sweetened condensed milk", "0.5 cup key lime juice", "1 (9 inch) prepared graham cracker crust"], "instructions": "Gather all ingredients.\nPreheat the oven to 375 degrees F (190 degrees C).\nCombine sweetened condensed milk, key lime juice, and egg yolks in a large bowl; mix well.\nPour mixture into unbaked graham cracker crust.\nBake in the preheated oven until filling is set, about 15 minutes.\nAllow to cool completely before slicing."}, {"title": "Sticky Toffee Pudding", "image_path": "Images2\\Sticky_Toffee_Pudding.jpg", "ingredients": ["1.5 cups finely chopped, pitted dates", "1.25 cups hot brewed tea", "0.75 cup white sugar", "2 tablespoons white sugar", "0.5 cup unsalted butter, softened", "3 large eggs", "2 cups all-purpose flour", "1.5 teaspoons baking powder", "1 teaspoon baking soda", "1 teaspoon vanilla extract", "1 teaspoon instant espresso coffee granules", "0.5 cup white sugar", "1 tablespoon white sugar", "0.75 cup brown sugar", "1 tablespoon brown sugar", "0.75 cup golden syrup", "1 tablespoon golden syrup", "0.5 cup unsalted butter", "1 cup heavy cream", "1 teaspoon vanilla extract"], "instructions": "Combine dates and tea in a bowl; set aside to soak for 15 minutes.\nPreheat the oven to 350 degrees F (180 degrees C). Grease an 8-inch round cake pan and line with parchment paper.\nCream 3/4 cups plus 2 tablespoons sugar and butter until light and fluffy. Beat in eggs, one at a time, mixing well after each addition. Sift in flour and baking powder and fold into the mixture.\nAdd baking soda, vanilla, and espresso granules to the date-tea mixture. Add mixture to the batter and stir to produce a loose, soft, dropping consistency. Pour into the prepared pan.\nBake in the preheated oven until a skewer inserted in the center comes out clean, 1 to 1 1/2 hours.\nWhen pudding is almost finished baking, combine 1/2 cup plus 1 tablespoon sugar, 3/4 cup plus 1 tablespoon brown sugar, 3/4 cup plus 1 tablespoon golden syrup, and butter for the sauce in a heavy saucepan over low heat until melted. Simmer for 5 minutes, then remove from heat. Gradually stir in cream and vanilla. Return to the heat and stir until smooth, 2 to 3 minutes.\nRemove pudding from the oven. Spoon a little sauce onto each serving plate. Place a portion of pudding on top, then pour over more sauce. Serve remaining sauce on the side."}, {"title": "Our Best Cheesecake", "image_path": "Images2\\Our_Best_Cheesecake.jpg", "ingredients": ["1.75 cups HONEY MAID Graham Cracker Crumbs", "0.33333334326744 cup butter, melted", "1.25 cups sugar, divided", "3 (8 ounce) packages PHILADELPHIA Cream Cheese, softened", "1 cup BREAKSTONE'S or KNUDSEN Sour Cream", "2 teaspoons vanilla", "3 eggs", "1 (21 ounce) can cherry pie filling"], "instructions": "Preheat the oven to 350 degrees F (180 degrees C).\nMix graham crumbs, butter, and 1/4 cup sugar together in a large bowl.\nPress crumbs onto bottom of 9-inch springform pan.\nBeat cream cheese and remaining sugar in large bowl with mixer until blended. Add sour cream and vanilla; mix well.\nAdd eggs, 1 at a time, beating on low speed after each addition just until blended.\nPour mixture over crust.\nBake in the preheated oven until the center is almost set, about 1 hour to 1 hour 10 minutes. Run knife around rim of pan to loosen cake; cool before removing rim. Refrigerate cheesecake 4 hours.\nTop with pie filling before serving."}, {"title": "Gooey Butter Cake", "image_path": "Images2\\Gooey_Butter_Cake.jpg", "ingredients": ["1 (18.25 ounce) package yellow cake mix", "0.5 cup butter, melted", "4 large eggs, divided", "2 teaspoons vanilla extract, divided", "1 (8 ounce) package cream cheese", "4 cups confectioners' sugar"], "instructions": "Gather all ingredients and preheat the oven to 350 degrees F (175 degrees C).\nMix together cake mix, butter, 2 eggs, and 1 teaspoon vanilla in a large bowl until well-combined. Pat mixture into a 9x13-inch dish.\nMix cream cheese, remaining 2 eggs, and remaining 1 teaspoon vanilla with an electric mixer in a bowl. Slowly beat in confectioner's sugar. Pour over cake layer.\nBake in the preheated oven until golden brown, 40 to 45 minutes. Cool before serving. Enjoy!"}, {"title": "Panettone", "image_path": "Images2\\Panettone.jpg", "ingredients": ["0.33333334326744 cup warm water (110 degrees F/45 degrees C)", "2 (.25 ounce) packages active dry yeast", "4 cups all-purpose flour", "0.5 cup warm milk", "0.66666668653488 cup white sugar", "4 eggs", "2 egg yolks", "1 teaspoon vanilla extract", "12 tablespoons unsalted butter", "2 cups candied mixed fruit", "2.5 teaspoons grated lemon zest", "2 tablespoons orange zest", "2 tablespoons butter, melted", "1 egg yolk", "1 tablespoon cream", "3 (7 x 4-inch) round paper panettone molds"], "instructions": "To make sponge, warm a small bowl by rinsing it with hot water. Pour in warm water and sprinkle 1 package yeast on it. Let stand until yeast has dissolved. Stir in 1/2 cup flour, cover with plastic wrap, and let stand 30 minutes, or until doubled. Sprinkle remaining yeast over warm milk. Let stand until dissolved. Beat together sugar, eggs, egg yolks, and vanilla. Stir in milk-yeast mixture. Add sponge and stir until well incorporated.\nCombine butter and remaining 3 ½ cups flour until crumbly. Slowly pour in egg mixture and beat on high speed 3 to 4 minutes, until dough is elastic looking and long strands form. Beat in fruit and zests. Turn dough into oiled bowl, cover with plastic wrap, and leave in a warm place to rise until doubled, about 2 to 3 hours.\nBrush inside of three 7 x 4-inch paper molds with melted butter. Turn dough out onto a lightly floured work surface and knead a few times to deflate. Divide dough into 3 pieces. Roll each piece into a ball and drop into prepared molds; place on a baking sheet about 4-inches apart and cover loosely with plastic wrap. Let rise in a warm place until doubled again, about 2 hours.\nPreheat the oven to 400 degrees F (200 degrees C). Cut an X in top of each loaf with oiled scissors. Combine egg yolk with cream. Brush tops of loaves lightly with egg wash.\nPlace baking sheet with loaves in bottom 1/3 of preheated oven. After 10 minutes, lower heat to 375 degrees F (190 degrees C). Continue to bake for 30 more minutes; if tops get too brown, cover with foil. Loaves are done when a wooden skewer inserted into centers comes out clean. Cool on wire rack."}, {"title": "Pumpkin Coconut Bread", "image_path": "Images2\\Pumpkin_Coconut_Bread.jpg", "ingredients": ["2 cups white sugar", "1 cup packed brown sugar", "1 cup vegetable oil", "4 eggs", "1 (15 ounce) can pumpkin puree", "3.5 cups all-purpose flour", "2 teaspoons baking soda", "2 teaspoons salt", "0.5 teaspoon ground cloves", "1.5 teaspoons ground cinnamon", "1 teaspoon ground allspice", "1 teaspoon ground nutmeg", "0.66670000553131 cup water", "1 cup flaked coconut", "0.5 cup chopped walnuts"], "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 x 5 inch loaf pans.\nMix together sugars, oil, and eggs. Mix in pumpkin. Add flour, salt, soda, and spices, and then water. Stir together until just moistened. Stir in coconut and nuts. Pour batter into prepared pans.\nBake for 60 minutes, or until tester inserted in the center comes out clean."}, {"title": "Cinnamon Bread", "image_path": "Images2\\Cinnamon_Bread.jpg", "ingredients": ["2 cups all-purpose flour", "1 cup white sugar", "1 cup buttermilk", "2 large eggs", "0.25 cup vegetable oil", "2 teaspoons vanilla extract", "2 teaspoons baking powder", "1.5 teaspoons ground cinnamon", "1 teaspoon salt", "0.5 teaspoon baking soda", "2 tablespoons white sugar", "2 teaspoons margarine", "1 teaspoon ground cinnamon"], "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Generously grease a 9x5-inch loaf pan.\nTo make the bread: Beat flour, sugar, buttermilk, eggs, oil, vanilla, baking powder, cinnamon, salt, and baking soda in a large mixing bowl until well combined, about 3 minutes. Pour batter into the prepared loaf pan; smooth the top.\nTo make the topping: Stir sugar, butter, and cinnamon together in a small bowl until crumbly; sprinkle over batter. Use a paring knife to swirl batter for a marbled effect.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 50 minutes. Remove bread from the pan to a wire rack to cool completely."}, {"title": "Gorditas", "image_path": "Images2\\Gorditas.jpg", "ingredients": ["1 cup masa harina (instant corn masa mix)", "1 cup hot water", "1 teaspoon salt", "1 cup all-purpose flour", "1 1/2 teaspoons baking powder", "1 tablespoon shortening", "1 cup oil for frying"], "instructions": "Stir masa harina, water, and salt together in a large bowl until combined.\nWhisk flour and baking powder together in a small bowl until combined.\nGradually stir flour mixture and shortening into masa harina mixture, using clean hands when mixture is cool enough to touch. If dough seems dry, add more hot water, 1 to 3 teaspoons at a time, until dough is somewhat clay-like in texture, evenly moistened, and tacky but not sticky.\nEvenly divide and roll dough into 6 balls (about 2 ½ inches or 2 ¾ ounces each); keep covered with plastic wrap while working.\nLine a work surface with waxed paper or plastic wrap; sprinkle lightly with water. Working with one ball at a time, flatten balls on the wet surface into a 5 ½-inch disc (about until about 1⁄8-inch thick). Transfer discs to a waxed paper- or plastic wrap-lined baking sheet; keep covered with plastic wrap while working with remaining dough.\nHeat a griddle or comal over medium heat. Working in batches if needed, cook gorditas until dry to the touch with some small, very lightly golden spots, about 2 to 3 minutes per side. Place gorditas in a single layer, uncovered, on large plates or a large baking sheet.\nHeat oil in a large, heavy skillet over medium to medium-high heat until hot enough to bubble immediately when edge of gordita is dipped in. Fry gorditas, one by one, until puffed, gently pressing it down into the oil occasionally with a spatula, about 45 seconds per side. Drain briefly on paper towels, then cut crosswise to create an opening large enough to stuff gorditas full of your favorite foods."}, {"title": "Crescent Roll Pretzels", "image_path": "Images2\\Crescent_Roll_Pretzels.jpg", "ingredients": ["1 (8 ounce) package refrigerated crescent roll dough (such as Pillsbury®", "8 cups water", "3 tablespoons baking soda", "1 small egg", "1 tablespoon water", "1 tablespoon butter, melted", "0.25 teaspoon coarse salt"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper and set aside.\nCombine 8 cups water and baking soda in a large pot and bring to a rolling boil over high heat. Once boiling, reduce heat and keep water at a simmer.\nStart at the large end and roll each crescent roll triangle into a large rope, about 12 inches long. Form rope into the shape of a pretzel.\nUsing a spider strainer, lower 1 pretzel at a time into the simmering water for 7 to 8 seconds. Place pretzels on parchment lined baking sheet. Combine egg and 1 tablespoon water in a small bowl. Brush each pretzel with egg mixture.\nBake in the preheated oven until golden brown, 12 to 14 minutes.\nRemove from oven. Brush each pretzel with melted butter and sprinkle with coarse salt while still hot."}, {"title": "Classic Glazed Doughnuts", "image_path": "Images2\\Classic_Glazed_Doughnuts.jpg", "ingredients": ["0.33 cup milk", "0.333 cup cake flour", "1 cup milk", "4.25 cups cake flour, plus more for dusting", "1 package active dry yeast", "5 ounces evaporated milk", "0.5 cup butter, melted and cooled", "2 large eggs", "0.25 cup sugar", "1 teaspoon salt", "1 teaspoon vanilla extract", "4 cups vegetable oil for frying", "3 cups powdered sugar", "0.5 cup melted butter", "1 tablespoon vanilla extract", "0.125 teaspoon salt", "6 tablespoons hot water"], "instructions": "For tangzhong, whisk together 1/3 cup milk and 1/3 cup cake flour in a small saucepan. Cook, stirring constantly, over medium heat until a very thick paste forms, about 3 minutes (watch constantly—it thickens quickly). Cool briefly.\nHeat 1 cup milk in a second saucepan to 105 degrees F to 115 degrees F (40 degrees C to 46 degrees C). Transfer warm milk to the bowl of a stand mixer; stir in yeast and let stand for 5 minutes.\nAdd evaporated milk, melted butter, eggs, sugar, salt, vanilla, the cooled tangzhong, and 2 cups cake flour to the stand mixer. Using the paddle attachment, beat at low speed until mixture is smooth, about 3 minutes. Gradually beat in remaining 2 1/4 cups cake flour to make a soft dough. Continue beating at low speed until dough is smooth, 2 to 3 minutes. Dough will be soft.\nTurn dough out onto a lightly floured surface. Knead dough until smooth, 2 to 3 minutes, adding 2 to 4 tablespoons additional cake flour. Be careful not to add too much flour. (If dough begins to stick to surface, use a bench scraper to lift dough from surface and add a dusting of flour. If your dough is too soft to knead, chill covered for 2 hours or up to overnight before kneading.) Shape dough into a ball. Transfer to a lightly greased bowl, turning once to grease surface; cover. Let rise in a warm place until doubled in size, 1 to 1 1/2 hours.\nPunch down dough and turn out onto floured surface. Roll dough into a 10x15-inch rectangle about 1/2-inch thick. If dough springs back, let it rest an additional 10 minutes. Lightly flour 2 large baking sheets.\nCut dough using 3-inch and 1-inch round cutters to create doughnuts and doughnut holes. Arrange cutouts 1 inch apart on the prepared baking sheets. Cover with a towel and let cutouts rise in a warm place until very light and fluffy, about 1 hour. [If you have scraps, gently knead together, being careful not to overwork dough; let rest 10 minutes before cutting.]\nArrange wire racks in two 10x15-inch rimmed baking pans (one for cooling, one for finished glazed doughnuts).\nAbout 20 minutes before doughnuts are done rising, pour oil to a depth of 2 1/2 to 3 inches into a large skillet or a deep-fat fryer. Heat to 365 degrees F (185 degrees C).\nWorking in batches of 2 to 3 doughnuts, fry, turning once halfway through, until golden, about 90 seconds. Transfer to prepared cooling rack to cool slightly. Repeat with remaining doughnuts. For doughnut holes, working in batches, fry, constantly moving with a slotted spoon, until evenly golden, about 1 minute. Transfer to prepared rack to cool slightly.\nWhisk together powdered sugar, melted butter, vanilla extract and salt in a bowl to make the vanilla glaze. Whisk in hot water, 1 tablespoon at a time, until desired consistency. If glaze thickens, stir in additional hot water, 1 teaspoon at a time.\nDip warm doughnuts and doughnut holes into vanilla glaze, turning to coat both sides. Arrange doughnuts on the second prepared rack to allow glaze to set, about 30 minutes."}, {"title": "Semla (Swedish Fat Tuesday Buns)", "image_path": "Images2\\Semla_(Swedish_Fat_Tuesday_Buns).jpg", "ingredients": ["1 cup warm milk (95-100 degrees F)", "1 package active dry yeast (2 teaspoons)", "1.33 cups all-purpose flour", "2 cups all-purpose flour", "7 tablespoons unsalted butter, at room temperature", "0.66 cup powdered sugar", "1 large egg", "2.5 teaspoons ground cardamom", "1 teaspoon kosher salt", "1 large egg", "1 teaspoon water", "14 ounces almond paste", "0.5 cup powdered sugar", "0.33 cup milk, or as needed to achieve desired texture", "1 teaspoon ground cardamom, or to taste", "1.5 cups heavy cream, whipped", "2 tablespoons powdered sugar for dusting"], "instructions": "Pour milk into the bowl of a stand mixer. Sprinkle yeast on top, followed by 1 1/3 cups flour and mix with a wooden spoon. Allow to stand until foamy, about 20 minutes.\nAdd flour, softened butter, powdered sugar, egg, cardamom, and salt; knead with dough hook (or by hand) until a soft, smooth, elastic dough forms, 5 to 6 minutes. Transfer dough to a lightly floured surface and shape into a ball. Divide into 12 equal portions. Using flour as necessary, roll dough under a cupped hand to form perfectly smooth balls.\nPlace dough balls evenly on a parchment lined baking sheet, leaving space in between and slightly push down. Dust tops with flour, and cover with a clean kitchen towel. Let rise in a warm spot until doubled in size, about 2 hours.\nPreheat the oven to 425 degrees F (220 degrees C).\nStir together egg and water in a small bowl and brush rolls all over with egg wash.\nBake in the preheated oven until lightly golden, about 12 minutes. Transfer buns onto a wire rack and let cool completely.\nCombine almond paste, powdered sugar, milk, and cardamom in a food processor and blend almond filling until smooth.\nCut a triangle from the top of the buns, and remove some of the crumbs to make room for the filling. Pipe almond filling into each bun, and top with whipped cream. Place the triangle on top and dust with powdered sugar before serving."}, {"title": "Grandma's Best Zucchini Bread", "image_path": "Images2\\Grandma's_Best_Zucchini_Bread.jpg", "ingredients": ["3 cups all-purpose flour", "0.5 teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon ground cinnamon", "1 pinch ground nutmeg", "1 pinch ground ginger", "1 pinch ground black pepper", "2 cups white sugar", "1 cup vegetable oil", "3 eggs, beaten", "2 teaspoons vanilla extract", "2 cups shredded zucchini", "0.5 cup dates, pitted and chopped"], "instructions": "Preheat the oven to 300 degrees F (150 degrees C). Grease and flour two 9x5-inch loaf pans.\nWhisk flour, baking powder, baking soda, cinnamon, nutmeg, ginger, and pepper together in a bowl until evenly combined; set aside.\nBeat sugar, oil, eggs and vanilla in a mixing bowl until smooth. Fold in flour mixture, zucchini, and dates until no dry spots remain. Divide the batter between the prepared loaf pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 70 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack."}, {"title": "Air Fryer Pretzel Crescent Rolls", "image_path": "Images2\\Air_Fryer_Pretzel_Crescent_Rolls.jpg", "ingredients": ["1 quart water", "0.25 cup baking soda", "1 (8 ounce) package refrigerated crescent roll dough", "pretzel salt", "cooking spray"], "instructions": "Place a large stock pot over high heat. Add water and bring to a boil over high heat.\nMeanwhile shape crescents into desired shape and preheat air fryer to 350°\nPreheat an air fryer to 350 degrees F (175 degrees C). Line the air fryer basket with a fitted piece of parchment. Generously spray with cooking spray.\nOnce water is boiling, carefully add baking soda (it WILL bubble up!). Lower crescent rolls into the brine with a spider strainer; boil for 5 seconds. Transfer onto the parchment paper in the air fryer basket. Sprinkle with salt.\nAir fry until crescent rolls are cooked through and golden, about 12 minutes. Serve immediately."}, {"title": "Pepper Jack Cornbread Biscuits", "image_path": "Images2\\Pepper_Jack_Cornbread_Biscuits.jpg", "ingredients": ["2 cups self-rising flour (see Tip)", "1 cup yellow cornmeal", "2 tablespoons white sugar", "0.5 teaspoon salt", "1 teaspoon baking soda", "1 stick (1/2 cup) very cold unsalted butter, cubed", "1.25 cups cold buttermilk", "2 ounces pepper Jack cheese", "2 tablespoons melted butter for brushing tops"], "instructions": "Gather all ingredients.\nMix together self-rising flour, cornmeal, white sugar, salt, and baking soda (See Cook's Note for substitution). Add cubed, very cold butter and mix in with a pastry cutter/blender until the mixture is crumbly and the butter pieces are approximately the size of lentils.\nStir in the buttermilk with a fork until a crumbly dough forms, which can be pressed together with your hands.\nPress into a square, and roll out into a 12 x12-inch square. Cut in half, and stack one piece on the other. Roll back out to a 12-inch square. Jagged edges are fine, and can simply be pressed in with a bench scraper.\nCut into quarters, and stack up. Square up the sides a little by pressing in with a bench scraper, and roll back out to a 12-inch square.\nPreheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with a Silpat mat.\nGrate the pepper Jack cheese over the top of the dough (for best results, pop cheese in the freezer for a few minutes to firm up, making it easier to grate and distribute evenly). Fold into thirds to form a rectangle, and press lightly.\nRoll until the rectangle is about 3/4 inch thick, and then use a floured round cutter (mine was 2.75 inches) to punch out 8 biscuits. Dough can also be cut into squares instead.\nTransfer cut dough to the prepared baking sheet. Extra dough can be pressed together and re-rolled, and used to cut more biscuits. Press each biscuit lightly in the center with your thumb. Brush each biscuit lightly with melted butter.\nBake in the preheated oven until nicely risen and golden brown, 18 to 20 minutes. While still warm, brush with more melted butter if desired. Let cool before serving. Enjoy!"}, {"title": "Adjarian Khachapuri", "image_path": "Images2\\Adjarian_Khachapuri.jpg", "ingredients": ["1.25 cups whole milk, heated to lukewarm (110° to 115°F)", "1 teaspoon active dry yeast", "0.75 teaspoon sugar", "3 cups flour, plus more for dusting", "1 tablespoon sunflower oil, plus more for brushing", "0.75 teaspoon plus a pinch of kosher salt", "2.25 cups shredded whole-milk mozzarella cheese", "0.5 cup whole-milk ricotta cheese", "4 large egg yolks", "2 tablespoons unsalted butter, softened"], "instructions": "Whisk together milk, yeast, and sugar in a large bowl. Let stand, covered with a kitchen towel, until mixture is foamy, about 10 minutes.\nSift flour into milk mixture. Add oil and 3/4 teaspoon salt; stir with a rubber spatula until mixture is well combined and a shaggy dough forms. Transfer to a work surface and shape into a ball; knead until smooth and soft but slightly sticky, about 5 minutes.\nShape dough into a ball and lightly brush with oil; transfer to a large bowl and cover loosely with plastic wrap. Let rise in a warm (70 to 80 degrees F (21 to 26 degrees C)) place until doubled in size, about 1 1/2 hours.\nStir together mozzarella and ricotta in a small bowl. Season with remaining pinch of salt; stir to combine.\nDivide dough into 4 equal portions. Roll each into a 5x8-inch oval, about 1/4 inch thick, on a lightly floured work surface. Spread about 1/4 cup cheese mixture over each oval, leaving a 11/2-inch border uncovered. Fold the long edges of each oval inward to meet at the center and pinch the seam together tightly to seal in cheese mixture. Turn dough over, so the seam side is down. Use a small, sharp knife to make a shallow lengthwise slit down the center of the top layer of dough, stopping within 1 inch of each end. Use your fingers to roll each long edge away from the slit and tuck it under to create a rolled border, sealing in some of the cheese mixture.\nEvenly divide and spread remaining cheese mixture (about 1/4 cup each) in the centers of each flatbread, lightly pressing into dough. Arrange flatbreads 2 to 3 inches apart on 2 parchment-lined baking sheets. Cover with a kitchen towel in a warm place (70° to 80°F) until slightly puffed, 25 to 30 minutes.\nPreheat the oven to 400 degrees F (200 degrees C).\nBake, rotating baking sheets halfway through, until edges are golden brown, 20 to 25 minutes. Use a spoon to make a well in the center of the filling in each flatbread. Put an egg yolk in each well. Bake until yolks are thickened but still runny, 30 to 40 seconds more.\nTransfer flatbreads to a serving platter. Top each with 1/2 tablespoon butter. Stir yolks into melted cheese. Serve hot."}, {"title": "Green Onion Garlic Naan Bread", "image_path": "Images2\\Green_Onion_Garlic_Naan_Bread.jpg", "ingredients": ["1.5 cups bread flour, plus more as needed", "0.5 teaspoon kosher salt", "2 teaspoons baking powder", "1 cup plain Greek yogurt", "4 cloves garlic, crushed", "0.5 cup thinly sliced green onions", "2 tablespoons melted butter"], "instructions": "Place bread flour in a bowl. Add salt and baking powder and give it a good whisk until evenly combined.\nAdd in Greek yogurt gently, followed by garlic and green onions. Take a wooden spoon and slowly start mixing everything together. Keep mixing, stirring, and pressing until a shaggy dough forms.\nTransfer dough to a work surface and use your hands to press dough together. Knead for a few minutes until dough becomes elastic and a little bit sticky. Add a bit more flour as necessary but try to keep extra flour at an absolute minimum. Knead until dough is a little bit stretchy, 3 to 5 minutes.\nWrap in plastic and allow to rest on the counter for 15 to 20 minutes.\nTake a bench scraper and cut into 6 equal pieces. Take 1 portion and roll into a ball. Place onto a generously floured surface. Use a rolling pin to roll out nice and thin, about 1/8 inch or less. It's ok if the naan is not a perfect circle. You will need extra flour for rolling out as the dough is sticky, but try to use as little as possible.\nHeat a cast iron skillet over medium-high heat until hot. Transfer dough circles into the hot dry skillet and cook until little bubbles form on the surface and the underside is lightly browned, about 1 minute. Flip naan over and cook for 1 more minute. Press down slightly with a spatula to increase the heat during cooking. Flip over twice more and cook for an additional 15 seconds per side, but make sure not to overcook to preserve the texture. Naan should still be flexible when you remove it from the skillet onto a plate.\nCover with a kitchen towel to keep warm and moist while you cook the other naan breads. Stack all 6 naan breads on top of each other and keep covered with a kitchen towel.\nWhen you are finished cooking all 6 naan breads, unstack breads and brush the first naan bread on both sides with a little bit of melted butter. Stack second piece of naan on top and only brush the top side. Keep stacking and buttering all the naan breads. Fold each naan into a triangle and serve."}, {"title": "Orange Cinnamon Rolls", "image_path": "Images2\\Orange_Cinnamon_Rolls.jpg", "ingredients": ["0.75 cup warm whole milk (110 degrees F (43 degrees C))", "1 (.25 ounce) package active dry yeast", "1 large egg, at room temperature", "1 large egg yolk, at room temperature", "0.5 cup unsalted butter, softened", "2 tablespoons honey", "1.5 teaspoons freshly grated orange zest", "0.25 cup freshly squeezed orange juice", "3.5 cups all-purpose flour, divided, or more as needed", "1.5 teaspoons kosher salt", "cooking spray", "0.5 cup unsalted butter, softened", "0.5 cup light brown sugar", "2 teaspoons ground cinnamon", "1.5 teaspoons freshly grated orange zest", "4 ounces cream cheese, softened", "1 cup powdered sugar", "1 tablespoon freshly grated orange zest", "1 tablespoon freshly squeezed orange juice", "0.25 teaspoon kosher salt"], "instructions": "Pour warmed milk into the bowl of a stand mixer fitted with a paddle attachment for the dough. Sprinkle yeast evenly over the surface of the milk. Let stand until foamy, 5 to 10 minutes.\nAdd egg and egg yolk, butter, honey, orange zest, and orange juice to the yeast mixture. Beat on low until combined, about 45 seconds. Add 2 cups flour; beat on low until a wet dough forms, about 1 minute. Turn off mixer; switch to the dough hook attachment. Add 1 1/2 cups flour and salt, beat on medium until dough is soft and elastic, 7 to 10 minutes. If necessary, add an additional 1/2 cup flour, tablespoon by tablespoon, using as little as possible to achieve a soft dough. The dough should be quite sticky.\nGather dough into a ball and transfer to a large greased bowl. Cover with plastic wrap and set aside to rise at room temperature until doubled in size, about 1 hour.\nCombine butter, brown sugar, cinnamon, and orange zest for the filling in a bowl. Mix with a spatula until smooth and creamy, about 1 minute. Set aside.\nPunch down the dough and transfer to a well-floured surface. Roll dough into a large 10 x 18-inches rectangle. Spread the filling over the surface of the dough, leaving a 1/2 inch border along the top long edge.\nRoll the dough away from you to create a log, and pinch seam to seal.\nCut dough log into 12 equal rolls (about 1 1/2 inches wide). Transfer rolls to a greased 13 x 9 inch baking dish. Loosely cover with plastic wrap, and set aside to rise at room temperature until puffy and almost doubled in size, 30 to 45 minutes.\nPreheat the oven to 375 degrees F (190 degrees C).\nBake rolls in the preheated oven until golden brown, 22 to 25 minutes.\nWhile rolls are baking, prepare the frosting. Combine cream cheese, powdered sugar, orange zest, orange zest, and salt in the bowl of a stand mixer fitted with the paddle attachment. Beat at medium-high speed until very smooth and creamy, 2 to 3 minutes.\nRemove rolls from oven and transfer to a wire rack. Let cool 2 minutes, then spread frosting evenly over the rolls. Serve warm."}, {"title": "\"Thousand Layer\" Chocolate Brioche", "image_path": "Images2\\Thousand_Layer_Chocolate_Brioche.jpg", "ingredients": ["0.75 cup warm whole milk", "1 package active dry yeast", "4.5 cups all-purpose flour", "3 large eggs, beaten", "0.33 cup white granulated sugar", "1 teaspoon fine salt", "6 tablespoons unsalted butter, very soft", "4 tablespoons unsalted butter for laminating dough", "0.5 cup dark chocolate chunks", "1 large whole egg for brushing", "coarse sea salt", "white granulated sugar"], "instructions": "Gather all ingredients.\nCombine warm milk and dry active yeast in the bowl of your stand mixer; let stand for 10 minutes. Add flour, eggs, sugar, and salt. Use the dough hook to knead the mixture until the flour almost disappears, about 1 minute. Add the soft room temperature butter, and continue kneading the dough until a very smooth ball of dough forms, 4 to 5 minutes.\nSet dough into a lightly buttered bowl, cover, and let rise in a warm spot until doubled in size, 2 to 3 hours.\nPunch down the dough and divide in 2 pieces. Form each half into a smooth ball and transfer each one into a plastic bag. Refrigerate bags overnight for best results or the dough can be used immediately. Each half of the dough will make 4 brioche.\nWhen ready to make, roll and stretch dough into a 14 x 10 inch rectangle. Spread 4 tablespoons of soft room temperature butter over two thirds of the dough, stopping 1/2 inch from the edge.\nFold unbuttered third up over the top, and then the opposite end to complete the trifold. Gently press and seal the edges together. Fold in thirds again to form a square. Wrap and place in the freezer until cold and slightly firm, about 15 minutes.\nRoll the dough out into a rectangle about 1/4 inch thick, or thin enough to fold, and repeat the two folding in thirds step. Wrap and place in the freezer again until cold and slightly firm, 15 more minutes. A little bit of water can be used to help the dough stick if needed.\nRoll dough out into a rectangle again, just like in the previous step. Fold into thirds, but keep as a rectangle (do not make the second fold). Wrap and place in the freezer until cold and slightly firm, about 15 minutes.\nRoll dough into a 12 x 6 inch rectangle and place in the freezer until cold and slightly firm, about 15 minutes.\nTrim off about 1/8 inch of dough from the sides and cut into 4 rectangles that are about 6 x 3 inches.\nStart with 1 piece (keeping the others in the fridge so they stay cool) and make two cuts starting 1/2 inch from top, all the way to the bottom to create 3 strips of dough. Braid together, and seal at bottom. Flip over and add about 1 tablespoon of dark chocolate chunks along the center of the braided dough, or more to taste. Roll up from the smaller end to create a knot. Place seam side down in buttered muffin tin.\nAfter all braids are done, cover, and let rise in a warm spot until doubled in size, about 1 hour. Preheat the oven to 400 degrees F (200 degrees C).\nBrush brioche with egg wash, and sprinkle very lightly with some coarse salt. Then sprinkle very generously with the granulated sugar.\nBake on the center rack of the preheated oven until nicely browned, 20 to 25 minutes. If brioches are getting too dark, tent with aluminum foil after 15 minutes.\nLet cool in the pan for about 5 minutes and then transfer onto a rack to cool completely before serving.\nServe and enjoy!"}, {"title": "Mochi Donuts", "image_path": "Images2\\Mochi_Donuts.jpg", "ingredients": ["1.5 cups Mochiko (sweet white rice flour, such as Asian’s Best), plus more for dusting", "1 cup tapioca flour", "0.5 cup granulated sugar", "1 tablespoon baking powder", "0.25 teaspoon kosher salt", "0.66 cup whole milk", "3 tablespoons unsalted butter, melted", "1 teaspoon vanilla extract", "1 large egg", "canola oil for frying", "1.25 cups powdered sugar", "2 tablespoons whole milk, or more as needed", "0.5 teaspoon vanilla extract", "1 tablespoon ground freeze dried fruit such as strawberry, mango or dragon fruit"], "instructions": "Combine rice flour, tapioca flour, sugar, baking powder, and salt in the bowl of a stand mixer fitted with the paddle attachment. Beat on low speed until combined, 1 minute. Add milk, butter, vanilla, and egg; beat on low speed until a smooth dough forms about 1 to 2 minutes (dough will be slightly sticky).\nLightly dust rice flour onto a clean work surface and turn dough onto surface. Divide dough into quarters and working in batches, roll dough quarters into 18-inch-long ropes about 1-inch wide.\nCut each rope into 1-inch pieces. Roll each piece into a ball, wetting hands as needed to help roll (about 72 each for 9 donuts).\nCut 9 square pieces of parchment paper, 5x5-inches, and place in a single layer on a baking sheet. Arrange 8 dough balls onto each piece parchment in a ring about 3 1/2 inches in diameter, connecting them side by side and using water to seal together.\nPour oil to a depth of 2 inches in a large Dutch oven; heat over medium-high to 350 degrees F (175 degrees C).\nPlace 3 dough rings, along with parchment, in hot oil. Remove parchment with tongs once dough floats to top of oil. Cook until golden and puffed, turning once halfway through, 2 to 3 minutes. Transfer to a wire rack lined with paper towels; cool 10 minutes. Repeat with remaining dough rings.\nFor the glaze whisk powdered sugar, 2 tablespoons milk, and vanilla together in a medium bowl. Mixture should be the consistency of heavy cream; add up to 1 tablespoon milk, 1 teaspoon at a time, as needed to adjust consistency. Dip tops of 4 or 5 doughnuts into the glaze; place on wire rack (with paper towel removed).\nStir 2 teaspoons dried fruit powder into remaining glaze. Dip remaining doughnuts in the glaze; transfer to wire rack and sprinkle with remaining fruit powder."}, {"title": "Chef John's Parker House Rolls", "image_path": "Images2\\Chef_John's_Parker_House_Rolls.jpg", "ingredients": ["0.5 cup warm milk", "0.5 cup warm water", "1 package active dry yeast", "2 large eggs", "3 tablespoons white sugar", "1.5 teaspoons kosher salt", "0.75 cup unsalted butter, melted, divided", "4.5 cups all-purpose flour, plus more as needed"], "instructions": "Combine warm milk, warm water, and dry yeast in the mixing bowl of a stand mixer . Let sit for 10 minutes. Add eggs, sugar, salt, and 1/2 cup melted butter. Whisk all wet ingredients together. Add all purpose flour and knead with the dough hook (or manually) until dough comes together as a ball, 5 to 6 minutes.\nPlace dough into a lightly buttered bowl, cover, and let sit until the dough is doubled in size, about 2 hours.\nPress the dough until it is flat, and divide into 24 equal portions. Form each portion into a smooth ball.\nLine a baking sheet with a Silpat mat or parchment paper.\nTake each ball of dough and roll out on a lightly floured surface into an oval, 4 to 5 inches long. Brush the top with some of the remaining butter and fold in half.\nTransfer the rolls to the prepared baking sheet, arranging in 6 rows of 4 rolls. Cover with a clean kitchen towel and let the rolls rise in a warm spot until almost doubled in size, about 1 hour.\nPreheat the oven to 350 degrees C (175 degrees C).\nBake rolls in the preheated oven until golden brown on top, about 25 minutes.\nWhile rolls are still warm, brush the tops of the rolls with melted butter."}, {"title": "Eggnog Cinnamon Rolls", "image_path": "Images2\\Eggnog_Cinnamon_Rolls.jpg", "ingredients": ["0.333 cup granulated sugar", "1 (.25 ounce) package quick-rising yeast (such as Fleischmann's RapidRise®)", "2 teaspoons kosher salt", "4.5 cups all-purpose flour, divided, or more as needed", "0.5 cup eggnog", "0.5 cup sour cream", "6 tablespoons unsalted butter, softened", "1 large egg, lightly beaten", "cooking spray", "0.5 cup unsalted butter, at room temperature", "1 cup firmly packed light brown sugar", "4 teaspoons ground cinnamon", "2 teaspoons freshly grated nutmeg, or to taste", "4 ounces cream cheese, at room temperature", "4 tablespoons unsalted butter", "1.5 cups powdered sugar", "4 tablespoons eggnog", "0.5 teaspoon vanilla extract"], "instructions": "Gather all ingredients.\nCombine sugar, yeast, salt, and 4 cups of the flour in the work bowl of a stand mixer fitted with the paddle attachment. Beat on low speed until just combined, about 15 seconds. With mixer running on low speed, add eggnog, sour cream, butter, and egg. Continue beating until dough forms, 1 to 2 minutes. Switch to a dough hook attachment. Beat on medium-low speed until dough is smooth and elastic, 6 to 9 minutes; gradually add remaining 1/2 cup flour, 1/2 to 1 teaspoon at a time, if necessary.\nPlace dough in a large bowl greased with cooking spray and turn to coat. Cover with a clean kitchen towel and let rise in a warm draft-free place until dough has doubled in size, 2 to 3 hours.\nSpray a 13- x 9-inch pan with cooking spray. Lightly punch down dough. On a lightly floured surface, roll dough into an 18- x 10-inch rectangle.\nFor the filling spread 1/2 cup of butter over the dough. In a small bowl, stir together brown sugar, cinnamon, and nutmeg. Sprinkle evenly over butter.\nStarting with one long side, roll dough into a log; pinch seam to seal.\nSlice into 12 rolls.\nPlace rolls in the prepared pan. Cover, and let rise in a warm draft-free place until doubled in size, 1 hour to 1 hour and 15 minutes.\nPreheat the oven to 350 degrees F (175 degrees C).\nBake in the preheated oven, uncovered, until golden brown, 25 to 30 minutes. Let cool in pan on a wire rack 15 minutes.\nAdd cream cheese and 4 tablespoons butter to the bowl of a stand mixer fitted with the paddle attachment; beat on medium speed until smooth, 1 to 2 minutes. Add powdered sugar, eggnog, and vanilla. Beat on medium speed until smooth, about 1 minute.\nDrizzle glaze over warm rolls. Serve with freshly grated nutmeg sprinkled on top and any extra glaze, if desired."}, {"title": "Quick Whole Wheat Chapati", "image_path": "Images2\\Quick_Whole_Wheat_Chapati.jpg", "ingredients": ["2.5 cups whole wheat flour", "0.75 teaspoon salt", "1 cup water"], "instructions": "Mix flour and salt together in a bowl. Stir in water to form a soft dough.\nTurn dough out onto a lightly floured work surface and knead several times. Divide into 8 pieces and roll each into a ball. Roll each ball into a very thin round using a rolling pin.\nHeat a griddle over medium-high heat. Cook each dough round on griddle until dough bubbles and blisters appear, about 2 minutes. Flip and cook until lightly browned on the other side."}, {"title": "Homemade Mini Cinnamon Rolls", "image_path": "Images2\\Homemade_Mini_Cinnamon_Rolls.jpg", "ingredients": ["0.75 cup milk", "0.25 cup water", "4 cups bread flour or all-purpose flour", "0.33 cup sugar", "1 (.25 ounce) package active dry yeast", "0.5 teaspoon salt", "2 large eggs, lightly beaten", "0.33 cup butter, melted", "0.66 cup brown sugar", "1.5 teaspoons cinnamon", "4 tablespoons butter, softened", "3 ounces cream cheese, softened", "1 tablespoon butter, softened", "1 tablespoon milk", "0.5 teaspoon vanilla extract", "2 cups powdered sugar"], "instructions": "Mix together milk and water in a glass measuring cup for the dough. Microwave mixture until it reaches 105 degrees F to 115 degrees F (40 degrees C to 46 degrees C), 30 to 60 seconds.\nWhisk together flour, sugar, yeast, and salt in a large bowl. Add eggs, melted butter, and milk mixture. Beat with an electric mixer at medium speed until a soft dough forms and begins to pull away from sides of bowl, 3 to 5 minutes. (Dough will be sticky.) Lightly grease a bowl. Transfer dough to the bowl and turn to coat. Chill, covered, until dough is easy to handle, at least 2 hours or up to overnight.\nGrease two 9-inch round cake pans or two 8x8-inch baking pans.\nStir together brown sugar and cinnamon in a small bowl. Punch down dough; divide in half. Roll out one portion of dough on a lightly floured surface into a 6x16-inch rectangle. (If dough springs back when rolling, let rest for 5 to 10 minutes.) Spread 2 tablespoons softened butter over the dough. Sprinkle half of the cinnamon-brown sugar mixture over butter; gently pat mixture so it adheres to the dough.\nStarting on a long side, roll up dough and pinch along seam to seal. Slice dough log into 16 (1-inch-thick) pieces. Put rolls, cut sides down, in one of the prepared pans. Repeat with the remaining dough, cinnamon-sugar, and softened butter. Let rise, covered, in a warm place until rolls nearly double in size, about 30 minutes.\nPreheat the oven to 375 degrees F (190 degrees C).\nBake until rolls until golden brown, 17 to 22 minutes. Cool in pan on a wire rack 10 minutes.\nMeanwhile for the icing, beat cream cheese, softened butter, milk, and vanilla with an electric mixer at medium speed until creamy, 1 to 2 minutes. Gradually beat in powdered sugar until smooth. Drizzle rolls with icing and serve warm."}, {"title": "Gingerbread Cinnamon Rolls", "image_path": "Images2\\Gingerbread_Cinnamon_Rolls.jpg", "ingredients": ["0.5 cup warm whole milk (110 degrees F (43 degrees C))", "3 tablespoons molasses", "1 (.25 ounce) envelope active dry yeast", "0.25 cup granulated sugar", "2 teaspoons kosher salt", "4.75 cups all-purpose flour, divided, or more as needed", "0.5 cup sour cream", "6 tablespoons unsalted butter, softened", "1 large egg, lightly beaten", "cooking spray", "0.5 cup unsalted butter, at room temperature", "1 cup firmly packed light brown sugar", "1 tablespoon molasses", "2 teaspoons ground cinnamon", "2 teaspoons ground ginger", "0.5 teaspoon ground cloves", "4 ounces cream cheese, at room temperature", "4 tablespoons unsalted butter, at room temperature", "1.5 cups powdered sugar", "0.5 teaspoon vanilla extract", "1 tablespoon whole milk, or more as needed"], "instructions": "Combine warm milk, molasses, and yeast in a small bowl and stir together until combined. Let sit until foamy, about 5 minutes.\nAdd sugar, salt, and 4 1/2 cups of the flour to the work bowl of a stand mixer fitted with the paddle attachment. Beat on low speed until just combined, about 15 seconds.\nWith mixer running on low speed, add milk mixture, sour cream, butter, and egg. Continue beating until dough forms, 1 to 2 minutes.\nSwitch to a dough hook attachment. Beat on medium-low speed until dough is smooth and elastic, 6 to 9 minutes; add remaining 1/4 cup flour 1/2 to 1 teaspoon at a time, if necessary.\nPlace dough in a large bowl greased with cooking spray and turn to coat. Cover with a clean kitchen towel. Let rise in a warm draft-free place until dough has doubled in size, 1 hour 30 minutes to 2 hours.\nSpray a 13x 9-inch pan with cooking spray. Lightly punch down dough. On a lightly floured surface, roll dough into an 18x10-inch rectangle.\nSpread 1/2 cup butter over dough for the filling. In a small bowl, stir together brown sugar, molasses, cinnamon, ginger, and cloves until well combined. Sprinkle evenly over butter.\nStarting with one long side, roll dough into a log, pinching seam to seal.\nSlice into 12 rolls. Place rolls in the prepared pan. Cover, and let rise in a warm draft-free place until doubled in size, 45 to 60 minutes.\nPreheat the oven to 350 degrees F (175 degrees C).\nBake in the preheated oven, uncovered, until golden brown, 25 to 30 minutes. Let cool in the pan on a wire rack for 15 minutes.\nAdd cream cheese and 4 tablespoons butter to the bowl of a stand mixer fitted with the paddle attachment; beat on medium speed until smooth, 1 to 2 minutes. Add powdered sugar, vanilla, and milk. Beat on medium speed until smooth, about 1 minute. If desired, add more milk, 1 teaspoon at a time, until desired consistency is reached.\nSpread glaze over warm rolls."}, {"title": "Lasagna Flatbread", "image_path": "Images2\\Lasagna_Flatbread.jpg", "ingredients": ["1 (15 ounce) container ricotta cheese", "1 (8 ounce) package shredded mozzarella cheese, divided", "1 (3 ounce) package Parmesan cheese", "1 egg", "2 teaspoons Italian seasoning", "1 pound sausage", "0.5 (26 ounce) jar marinara sauce", "6 flatbreads"], "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine ricotta cheese, 1/2 of the mozzarella cheese, Parmesan cheese, egg, and Italian seasoning in a bowl.\nCook sausage in a skillet over medium heat until no longer pink, 5 to 10 minutes; drain. Stir in marinara sauce.\nSpread 1/6 of the cheese mixture evenly on each flatbread; cover with sausage mixture. Top with remaining mozzarella cheese.\nBake in the preheated oven until cheese is melted and bubbly, 10 to 15 minutes."}, {"title": "Cinnamon Babka", "image_path": "Images2\\Cinnamon_Babka.jpg", "ingredients": ["3 cups all-purpose flour", "1 (.25 ounce) package instant yeast", "0.25 cup granulated sugar", "1.25 teaspoons kosher salt", "0.25 teaspoon ground cinnamon", "1 large egg", "0.5 cup warm water (105 degrees F to 115 degrees F)", "5 tablespoons unsalted butter, at room temperature", "1.5 teaspoons vanilla extract", "cooking spray", "0.5 cup firmly packed light brown sugar", "0.25 cup all-purpose flour", "4 teaspoons ground cinnamon", "0.25 cup unsalted butter, melted and cooled", "1 large egg yolk", "1 tablespoon tap water", "2 tablespoons all-purpose flour", "1 tablespoon firmly packed light brown sugar", "0.5 teaspoon ground cinnamon", "0.125 teaspoon kosher salt", "2 tablespoons cold unsalted butter"], "instructions": "Combine flour, yeast, sugar, salt, and cinnamon in the work bowl of a stand mixer fitted with dough hook attachment; mix on low until combined. Add egg, warm water, butter, and vanilla; continue mixing on low until dough begins to come together, about 1 minute. Increase speed to medium and continue beating until dough is soft and smooth, about 5 minutes.\nSpray a large bowl with cooking spray and set dough inside. Cover and let stand in a warm place (75 degrees F (23 degrees C)) until doubled in size, 1 1/2 to 2 hours.\nPunch down the dough, and turn out onto a lightly floured surface. Roll into a 9x18-inch rectangle about 1/4-inch thick. Let rest, uncovered, at room temperature, about 10 minutes. Lightly spray a 9x5-inch loaf pan with cooking spray.\nWhile the dough is resting, stir together sugar, flour, and cinnamon for the filling in a small bowl until combined. Stir in melted butter until mixture is smooth. If dough shrank while resting, re-roll into a 9x 18-inch rectangle. Spread filling in an even layer over the dough, leaving a 1/2-inch border around the edges.\nBeginning with the long edge, roll dough gently into a log, pinching seam and ends to seal. Using a serrated knife, cut log in half lengthwise. With cut sides up, twist the two pieces together; tuck ends underneath and place into the prepared loaf pan. Whisk together egg yolk and 1 tablespoon water; gently brush egg wash over the dough.\nStir together flour, sugar, cinnamon, and salt for the topping in a bowl until combined. Using your fingers, work in cold butter until coarse crumbs form. Sprinkle topping evenly over the loaf. Loosely cover loaf and let rise in a warm place (75 degrees F (23 degrees C)) until doubled in size, about 1 hour.\nPreheat the oven to 350 degrees F (175 degrees C). Bake uncovered in the preheated oven until babka is a deep golden brown and a thermometer inserted in the center registers 190 degrees F (87 degrees C), about 45 minutes. After about 25 minutes, cover babka with aluminum foil so surface does not get too dark.\nSet the pan on a wire rack and allow to cool, 10 minutes. Remove from the pan; let cool slightly, about 20 minutes more. Serve warm."}, {"title": "Golden Sweet Cornbread", "image_path": "Images2\\Golden_Sweet_Cornbread.jpg", "ingredients": ["1 cup all-purpose flour", "1 cup yellow cornmeal", "0.66666668653488 cup white sugar", "3.5 teaspoons baking powder", "1 teaspoon salt", "1 cup milk", "0.33333334326744 cup vegetable oil", "1 large egg"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Lightly grease a 9-inch round cake pan.\nWhisk flour, cornmeal, sugar, baking powder, and salt together in a large bowl. Add milk, vegetable oil, and egg; whisk until well combined. Pour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center of the pan comes out clean, 20 to 25 minutes."}, {"title": "To Die For Blueberry Muffins", "image_path": "Images2\\To_Die_For_Blueberry_Muffins.jpg", "ingredients": ["1.5 cups all-purpose flour", "0.75 cup white sugar", "2 teaspoons baking powder", "0.5 teaspoon salt", "0.33333334326744 cup vegetable oil", "1 egg", "0.33333334326744 cup milk, or more as needed", "1 cup fresh blueberries", "0.5 cup white sugar", "0.33333334326744 cup all-purpose flour", "0.25 cup butter, cubed", "1.5 teaspoons ground cinnamon"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Grease 8 muffin cups or line with paper liners.\nTo make the muffins: Whisk flour, sugar, baking powder, and salt together in a large bowl.\nPour oil into a small liquid measuring cup. Add egg and enough milk to reach the 1-cup mark; stir until combined. Pour into flour mixture and mix just until batter is combined. Fold in blueberries; set batter aside.\nTo make the crumb topping: Combine sugar, flour, butter, and cinnamon in a small bowl. Mix with a fork until crumbly.\nSpoon batter into the prepared muffin cups, filling right to the top. Sprinkle with crumb topping.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, 20 to 25 minutes."}, {"title": "Banana Banana Bread", "image_path": "Images2\\Banana_Banana_Bread.jpg", "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking soda", "0.25 teaspoon salt", "0.75 cup brown sugar", "0.5 cup butter", "2 eggs, beaten", "2.3333332538605 cups mashed overripe bananas"], "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan.\nCombine flour, baking soda, and salt in a large bowl. Beat brown sugar and butter with an electric mixer in a separate large bowl until smooth. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture until just combined. Pour batter into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 60 minutes. Let bread cool in pan for 10 minutes, then turn out onto a wire rack to cool completely."}, {"title": "Mom's Zucchini Bread", "image_path": "Images2\\Mom's_Zucchini_Bread.jpg", "ingredients": ["3 cups all-purpose flour", "1 teaspoon salt", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 tablespoon ground cinnamon", "3 large eggs", "1 cup vegetable oil", "2.25 cups white sugar", "3 teaspoons vanilla extract", "2 cups grated zucchini", "1 cup chopped walnuts"], "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease and flour two 8x4-inch pans.\nSift flour, salt, baking powder, baking soda, and cinnamon together in a large bowl.\nBeat eggs, oil, sugar, and vanilla together in a separate large bowl with an electric mixer until combined; add flour mixture and beat well. Stir in zucchini and walnuts until well combined. Pour batter into the prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 to 60 minutes. Cool in the pans on a wire rack for 20 minutes. Run a table knife around the edges to loosen. Invert carefully onto a wire rack and let cool completely."}, {"title": "Banana Chocolate Chip Bread", "image_path": "Images2\\Banana_Chocolate_Chip_Bread.jpg", "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "3 ripe bananas, mashed", "1 tablespoon milk", "1 teaspoon ground cinnamon, or to taste", "1 cup white sugar", "0.5 cup butter, softened", "2 large eggs", "1 cup semisweet chocolate chips"], "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan, preferably glass.\nMix flour, baking powder, baking soda, and salt in a bowl. Stir bananas, milk, and cinnamon in another bowl. Beat sugar and butter together in a third bowl with an electric mixer until light and fluffy; add eggs one at a time, beating well after each addition. Stir banana mixture into butter mixture; mix in flour mixture until just blended. Fold in chocolate chips; pour batter into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 70 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack before slicing."}, {"title": "Easy Homemade Pizza Dough", "image_path": "Images2\\Easy_Homemade_Pizza_Dough.jpg", "ingredients": ["1 cup warm water (110 degrees F/45 degrees C)", "1 (.25 ounce) package active dry yeast", "1 teaspoon white sugar", "2.5 cups bread flour", "2 tablespoons olive oil", "1 teaspoon salt"], "instructions": "Gather all ingredients. Preheat oven to 450 degrees F (230 degrees C), and lightly grease a pizza pan.\nPlace warm water in a bowl; add yeast and sugar. Mix and let stand until creamy, about 10 minutes.\nAdd flour, oil, and salt to the yeast mixture; beat until smooth. You can do this by hand or use a stand mixer fitted with a dough hook to make it easier.\nLet rest for 5 minutes.\nTurn dough out onto a lightly floured surface and pat or roll into a 12-inch circle.\nTransfer to the prepared pizza pan.\nSpread crust with sauce and toppings of your choice.\nBake in the preheated oven until golden brown, 15 to 20 minutes. Remove from the oven and let cool for 5 minutes before serving."}, {"title": "Banana Muffins", "image_path": "Images2\\Banana_Muffins.jpg", "ingredients": ["1.5 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "0.5 teaspoon salt", "3 large bananas, mashed", "0.75 cup white sugar", "1 egg", "0.33333334326744 cup butter, melted"], "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 12-cup muffin tin or line cups with paper liners. Sift flour, baking powder, baking soda, and salt together in a bowl; set aside.\nMix bananas, sugar, egg, and melted butter in a separate large bowl until well combined; fold in flour mixture until smooth. Spoon batter into the prepared muffin cups, filling each 2/3 full.\nBake in the preheated oven until tops spring back when lightly pressed, about 25 to 30 minutes. Cool briefly in the tin, then transfer to a wire rack to cool completely."}, {"title": "Cinnamon Roll Monkey Bread", "image_path": "Images2\\Cinnamon_Roll_Monkey_Bread.jpg", "ingredients": ["0.5 cup white sugar", "1 teaspoon ground cinnamon", "1 (12.4 ounce) package refrigerated cinnamon roll dough with icing", "0.25 cup unsalted butter, melted"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Grease a 9x5-inch loaf pan.\nMix sugar and cinnamon together in a bowl.\nSet icing packet aside. Cut cinnamon rolls into quarters. Dip pieces in melted butter, coat in cinnamon-sugar, and place in the prepared pan.\nBake in the preheated oven until dough has risen and top is golden brown, 20 to 25 minutes; drizzle icing over top and let cool in the pan for 5 minutes. Turn the monkey bread out onto a plate and serve warm."}, {"title": "Homemade Flour Tortillas", "image_path": "Images2\\Homemade_Flour_Tortillas.jpg", "ingredients": ["4 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt", "2 tablespoons lard", "1.5 cups water"], "instructions": "Whisk flour, baking powder, and salt together in a mixing bowl. Rub in lard with your fingers until mixture resembles cornmeal. Add water and mix until dough comes together.\nTransfer dough onto a lightly floured surface; knead for a few minutes until smooth and elastic. Divide dough into 24 equal pieces and roll each piece into a ball.\nPreheat a large skillet over medium-high heat. Use a well-floured rolling pin to roll a dough ball into a thin, round tortilla. Place into the hot skillet, and cook until bubbly and golden; flip and continue cooking until golden on the other side. Place the cooked tortilla in a tortilla warmer; continue rolling and cooking the remaining dough."}, {"title": "Janet's Rich Banana Bread", "image_path": "Images2\\Janet's_Rich_Banana_Bread.jpg", "ingredients": ["1 cup white sugar", "0.5 cup butter, melted", "2 eggs", "1 teaspoon vanilla extract", "1.5 cups all-purpose flour", "1 teaspoon baking soda", "0.5 teaspoon salt", "0.5 cup sour cream", "0.5 cup chopped walnuts", "2 medium bananas, sliced"], "instructions": "Gather all ingredients. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\nStir sugar and melted butter together in a large bowl. Add eggs and vanilla; mix well. Combine flour, baking soda, and salt; stir into butter mixture until smooth.\nFold in banana slices, sour cream, and walnuts; transfer into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, about 1 hour.\nCool loaf in the pan for 10 minutes before inverting onto a wire rack to cool completely.\nServe and enjoy!"}, {"title": "Best Bread Machine Bread", "image_path": "Images2\\Best_Bread_Machine_Bread.jpg", "ingredients": ["1 cup warm water (110 degrees F/45 degrees C)", "2 tablespoons white sugar", "1 (.25 ounce) package bread machine yeast", "0.25 cup vegetable oil", "3 cups bread flour", "1 teaspoon salt"], "instructions": "Place water, sugar, and yeast in the pan of the bread machine. Let yeast dissolve and foam for 10 minutes. Add oil, flour, and salt to the yeast. Select Basic or White Bread setting, and press Start.\nRemove loaf from the machine after the cycle is done; cool in the pan for 5 minutes before turning it out onto a rack to cool completely."}, {"title": "Chocolate Chip Muffins", "image_path": "Images2\\Chocolate_Chip_Muffins.jpg", "ingredients": ["0.75 cup milk", "0.33333334326744 cup vegetable oil", "1 egg", "2 cups all-purpose flour", "0.5 cup white sugar", "3 teaspoons baking powder", "0.5 teaspoon salt", "0.75 cup mini semi-sweet chocolate chips", "3 tablespoons white sugar", "2 tablespoons brown sugar"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Grease a 12-cup muffin tin or line cups with paper liners.\nCombine milk, oil, and egg in a small bowl until well blended. Combine flour, 1/2 cup sugar, baking powder, and salt together in a large bowl, making a well in the center. Pour milk mixture into well and stir until batter is just combined; fold in chocolate chips.\nSpoon batter into the prepared muffin cups, filling each 2/3 full. Mix 3 tablespoons white sugar and brown sugar together in a small bowl; sprinkle on tops of muffins.\nBake in the preheated oven until tops spring back when lightly pressed, about 20 to 25 minutes. Cool in the tin briefly, then transfer to a wire rack. Serve warm or cool completely."}, {"title": "Downeast Maine Pumpkin Bread", "image_path": "Images2\\Downeast_Maine_Pumpkin_Bread.jpg", "ingredients": ["1 (15 ounce) can pumpkin puree", "4 eggs", "1 cup vegetable oil", "0.66666668653488 cup water", "3 cups white sugar", "3.5 cups all-purpose flour", "2 teaspoons baking soda", "1.5 teaspoons salt", "1 teaspoon ground cinnamon", "1 teaspoon ground nutmeg", "0.5 teaspoon ground cloves", "0.25 teaspoon ground ginger"], "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9x5-inch loaf pans.\nWhisk flour, baking soda, salt, cinnamon, nutmeg, cloves, and ginger together in a large bowl.\nMix pumpkin puree, eggs, oil, water, and sugar in a separate bowl until well blended.\nStir flour mixture into pumpkin mixture until just blended.\nPour batter into the prepared pans.\nBake in the preheated oven until a toothpick inserted in center comes out clean, about 50 minutes.\nEnjoy!"}, {"title": "Scones", "image_path": "Images2\\Scones.jpg", "ingredients": ["3 cups all-purpose flour, plus more for kneading", "0.5 cup white sugar", "5 teaspoons baking powder", "0.5 teaspoon salt", "0.75 cup butter", "1 cup milk", "1 egg, beaten"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.\nCombine flour, sugar, baking powder, and salt in a large bowl; cut in butter with 2 knives or a pastry blender until mixture resembles coarse crumbs. Whisk milk and egg in a small bowl; gradually stir into flour mixture until moistened.\nTurn dough out onto a lightly floured surface and knead briefly, 5 or 6 turns. Pat or roll dough out into a 1/2-inch thick round. Cut into 8 wedge-shaped pieces and place onto the prepared baking sheet.\nBake scones in the preheated oven until golden brown on top, about 15 minutes."}, {"title": "Best Monkey Bread", "image_path": "Images2\\Best_Monkey_Bread.jpg", "ingredients": ["1 cup white sugar", "2 teaspoons ground cinnamon", "3 (12 ounce) packages refrigerated biscuit dough", "0.5 cup chopped walnuts", "0.5 cup raisins", "0.5 cup margarine", "1 cup packed brown sugar"], "instructions": "Gather all ingredients.\nPreheat oven to 350 degrees F (175 degrees C). Grease one 9- or 10-inch tube or Bundt pan.\nMix white sugar and cinnamon in a plastic bag. Cut biscuits into quarters. Shake 6 to 8 biscuit pieces in the sugar-cinnamon mix.\nArrange pieces in the bottom of the prepared pan. Continue until all biscuits are coated and placed in the pan. If using walnuts and raisins, arrange in and among the biscuit pieces as you go along.\nMelt butter and brown sugar in a small saucepan over medium heat. Boil for 1 minute; pour over biscuits.\nBake in the preheated oven for 35 minutes. Let bread cool in the pan for 10 minutes, then turn out onto a plate and let everyone pull it apart."}, {"title": "Best Ever Muffins", "image_path": "Images2\\Best_Ever_Muffins.jpg", "ingredients": ["2 cups all-purpose flour", "3 teaspoons baking powder", "0.5 teaspoon salt", "0.75 cup white sugar", "1 egg", "1 cup milk", "0.25 cup vegetable oil"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Grease a 12-cup muffin tin or line cups with paper liners.\nStir flour, baking powder, salt, and sugar together in a large bowl; make a well in the center.\nBeat egg with a fork in a small bowl or 2-cup measuring cup; whisk in milk and oil. Pour egg mixture all at once into flour mixture; mix quickly and lightly with a fork until just moistened. The batter will be lumpy. (Fold in additional ingredients if using; see variations below). Spoon batter into the prepared muffin cups, filling each 3/4 full.\nBake in the preheated oven until tops spring back when lightly pressed, about 25 minutes."}, {"title": "Amazingly Easy Irish Soda Bread", "image_path": "Images2\\Amazingly_Easy_Irish_Soda_Bread.jpg", "ingredients": ["4 cups all-purpose flour", "0.5 cup margarine, softened", "4 tablespoons white sugar", "1 teaspoon baking soda", "1 tablespoon baking powder", "0.5 teaspoon salt", "1 cup buttermilk", "1 egg", "0.25 cup butter, melted", "0.25 cup buttermilk"], "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Lightly grease a large baking sheet.\nMix flour, softened margarine, sugar, baking soda, baking powder, and salt together in a large bowl. Stir in 1 cup of buttermilk and egg. Turn dough out onto a lightly floured surface and knead slightly. Form dough into a round loaf and place on the prepared baking sheet. Note that the dough will be a little sticky.\nCombine melted butter with 1/4 cup buttermilk in a small bowl; brush loaf with this mixture. Use a sharp knife to cut an 'X' into the top of the loaf.\nBake in preheated oven until a toothpick inserted into the center of the loaf comes out clean, 45 to 50 minutes. Check for doneness after 30 minutes. You may continue to brush the loaf with the butter mixture while it bakes."}, {"title": "Quick Cinnamon Rolls", "image_path": "Images2\\Quick_Cinnamon_Rolls.jpg", "ingredients": ["0.25 cup butter, divided", "2 cups all-purpose flour, or more as needed", "2 tablespoons white sugar", "2 teaspoons baking powder", "1 teaspoon salt", "3 tablespoons butter, softened", "0.75 cup milk", "0.5 cup white sugar", "0.5 cup brown sugar", "1 tablespoon ground cinnamon", "1 cup confectioners' sugar", "4 ounces cream cheese, softened", "0.25 cup butter, softened", "0.5 teaspoon vanilla extract"], "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Brush an 8-inch square baking dish with 1 tablespoon of the melted butter.\nTo make the dough: Whisk flour, white sugar, baking powder, and salt together in a large bowl. Work 3 tablespoons softened butter into flour mixture using your hands until butter is lentil-sized.\nPour milk into flour-butter mixture and stir with a rubber spatula until a soft dough forms.\nTurn dough out onto a well-floured work surface and roll dough into a 10- x 10-inch square. Brush surface of dough with remaining 2 tablespoons melted butter.\nTo make the filling: Whisk ¼ cup white sugar, brown sugar, and cinnamon together in a small bowl. Sprinkle 1 tablespoon cinnamon-sugar mixture in the bottom of the prepared baking dish. Sprinkle remaining cinnamon sugar over butter-brushed dough.\nRoll dough around filling to form a log; cut log into 9 rolls about 1-inch wide; place rolls, cut-side up, in the prepared baking dish.\nBake in the preheated oven until rolls are puffed and lightly golden, 20 to 25 minutes.\nTo make the frosting: Beat confectioners' sugar, cream cheese, 1/4 cup softened butter, and vanilla extract together in a bowl until frosting is smooth.\nTop hot cinnamon rolls with cream cheese frosting."}, {"title": "Basic Biscuits", "image_path": "Images2\\Basic_Biscuits.jpg", "ingredients": ["2 cups all-purpose flour", "1 tablespoon baking powder", "0.5 teaspoon salt", "0.5 cup shortening", "0.75 cup cold milk"], "instructions": "Gather all ingredients and preheat oven to 450 degrees F (230 degrees C).\nIn a large mixing bowl sift together flour, baking powder and salt. Cut in shortening with fork or pastry blender until mixture resembles coarse crumbs.\nPour milk into flour mixture while stirring with a fork. Mix in milk until dough is soft, moist and pulls away from the side of the bowl.\nTurn dough out onto a lightly floured surface and knead dough briefly, 5 to 7 times.\nRoll dough out into a 1/2 inch thick sheet and cut out biscuits with a floured cookie cutter. Press together unused dough and repeat rolling and cutting procedure.\nPlace biscuits on ungreased baking sheets and bake in preheated oven until golden brown, about 10 minutes.\nEnjoy!"}, {"title": "Indian Fry Bread", "image_path": "Images2\\Indian_Fry_Bread.jpg", "ingredients": ["2 cups all-purpose flour", "2 teaspoons baking powder", "0.5 teaspoon salt", "0.75 cup cold water", "1 tablespoon vegetable oil", "oil for frying"], "instructions": "Combine flour, baking powder, and salt in a bowl. Stir in cold water and vegetable oil until dough comes together into a ball.\nSet dough on a floured surface. Pinch off ten pieces the size of golf balls, roll into balls, and flatten each into a round. Make a small hole in the center of each round.\nFill a deep skillet with oil to 3/4 inch; heat over medium-high heat. Add dough rounds in batches and fry until golden brown, about 20 seconds per side. Drain on paper towels."}, {"title": "Easy Sourdough Biscuits", "image_path": "Images2\\Easy_Sourdough_Biscuits.jpg", "ingredients": ["3 cups all-purpose flour", "2 cups sourdough starter", "2 teaspoons baking powder", "1 teaspoon salt", "6 tablespoons cold salted butter", "1 cup milk, or more as needed"], "instructions": "Preheat the oven to 425 degrees F (220 degrees C). Butter a cast iron pan.\nMix flour, sourdough starter, baking powder, and salt together in a large bowl. Grate in cold butter and mix until well combined. Add 1 cup milk and stir until just mixed. Add more milk if necessary until dough is sticky but not wet.\nKnead dough 3 to 4 times on a floured surface and flatten to a 1- to 2-inch thickness. Cut out 10 biscuits and put in the prepared pan.\nBake in the preheated oven until golden brown, about 15 minutes."}]